[["What is inbound marketing and how can it help you drive traffic to your site? https://t.co/TYFXt5JJf4 https://t.co/RqIaIIc3iY", "2019-09-27 00:05:03"], ["Want to build a more recognizable brand? Here are 6 tactics to boost your brand awareness from referral programs to freebies. https://t.co/T13cctWMap https://t.co/dZMCrWGNBn", "2019-09-24 22:26:03"], ["Social media marketing is time consuming. Here are 50 of the best (free and paid) tools to streamline your social media efforts. https://t.co/tE1Y22rgwu https://t.co/GLVKT0x0qk", "2019-09-20 00:08:04"], ["Looking for ways to reconnect with your audience? Consider retargeting them through the world’s biggest social network, Facebook: https://t.co/oC3sUEbS7a https://t.co/0kVjxl4juz", "2019-09-17 21:19:02"], ["Did you know that 97% of first-time website visitors leave without buying anything? Re-connect with your website visitors through Google remarketing. https://t.co/51B66A7CBp", "2019-09-12 19:37:04"], ["The only constant in a marketer’s life is change. Here are the most important trends to incorporate into your marketing strategy. https://t.co/szWFRfZaKT", "2019-09-10 22:09:04"], ["What is a squeeze page and how can it help you grow your email list? https://t.co/kUmpzLN24S", "2019-08-30 00:32:05"], ["Did you know Facebook has increased their efforts to tackle fake news using Click-Gap? Here’s what you need to know and how to ensure your posts remain visible on Facebook. https://t.co/oKwDA9YOaT", "2019-08-26 17:39:04"], ["Want to improve your conversion rate? Check out these 7 strategies including testing different CTAs and adding key trust signals. https://t.co/8zEr6XYbm9", "2019-08-22 20:12:01"], ["Track, analyze, and respond to conversations about your brand and industry online with the best social listening tools. https://t.co/OobZqcLlhE", "2019-08-21 17:22:28"], ["What does it take to be a successful social media manager? Here’s what 30 social media marketing pros had to say. https://t.co/4IikSqg40S", "2019-08-20 17:29:01"], ["Looking for new strategies to drive traffic to your website? Here are 10 proven tactics that are also easy to implement. https://t.co/fLKoYjlix9", "2019-08-15 22:39:03"], ["Are you seeing fewer interactions and less followers on social media? Here are 5 tactics to turn it around and improve your engagement rates. https://t.co/70cZg9zGYK", "2019-08-07 17:02:04"], ["According to Buffer, 'reposting was a key factor in growing [their] Instagram audience by over 60 percent.' Here are tips and tools to start regramming on your Instagram account: https://t.co/mocNBDhXD1", "2019-08-06 20:34:03"], ["Are you optimizing your social media presence? Here are 9 quick tips to start improving your social media optimization today. https://t.co/6gvc3AwYnZ", "2019-07-31 21:22:05"], ["80% of consumers would rather watch live video from a brand than read a blog. Here’s what marketers should know about video marketing and how to get started. https://t.co/hAMdGnnAku", "2019-07-30 21:36:01"], ["Are you reaching your target market on Facebook? Check out our guide for Facebook ad targeting and prime audiences you may be forgetting. https://t.co/pK3KD0fRYq", "2019-07-29 17:17:03"], ["Want to standout from 1 billion Instagram users and attract more followers? Check out these creative tactics from 20 social media pros. https://t.co/I7OjYoLEPj", "2019-07-25 22:03:05"], ["Did you know social media messages are reshared 24x more often when they’re shared by employees instead of the brand itself? Here are 49 more social media tips and best practices to improve your strategy. https://t.co/kQeoBvvAAt", "2019-07-19 17:11:04"], ["Want more YouTube subscribers in 2019? Here are 7 best practices to attract more followers:  https://t.co/mpSrnx9a8w", "2019-07-18 20:55:05"], ["We’re excited to introduce 20 new share buttons for popular channels like Gmail, Baidu, and Evernote to help expand the reach of your website! https://t.co/tmHW5PrlsX", "2019-07-17 21:04:53"], ["Are you reviewing your Instagram analytics beyond likes and followers? Here are 14 key metrics you should explore (and learn from!) https://t.co/B4vSCf0RPt", "2019-07-15 22:46:04"], ["Are you engaging your audience on Instagram? Here are 50 need-to-know stats to shape your Instagram marketing strategy. https://t.co/ZNfpfwVn9r", "2019-07-12 20:42:02"], ["97% of consumers don’t consider marketers to be trustworthy. So how do you gain their trust?  https://t.co/l3cMOM5vdc", "2019-07-11 22:25:02"], ["Looking to spruce up your Facebook business page? Here are 4 Inspirational examples to draw inspiration from and 7 elements that should be included on every page. https://t.co/RM9F7QxJV5", "2019-07-10 21:29:01"], ["Facebook advertising is becoming increasingly competitive. Stand out from the rest with these tips and favorite ads from social media advertising experts. https://t.co/j9Tsx3Vhtf", "2019-07-09 21:57:03"], ["Want to run a successful Twitter advertising campaign? The pros say to consider segmentation, timely content, and user experience, just to name a few. https://t.co/KCi0KsWzTs", "2019-07-04 01:10:05"], ["If you’re not already running ads on Facebook, you’re missing out on the opportunity to reach 2.32 billion active users per month. To get started, check out our 5 best practices and favorite Facebook ads. https://t.co/IZ4KKBmRic", "2019-07-02 20:29:05"], ["The average Facebook user is logging in 5-6x times daily – are you posting enough to keep them interested? Check out more actionable Facebook stats here: https://t.co/4jJE9JsdJM", "2019-06-29 21:38:02"], ["Controversial ads are risky, but they get people talking and have the power to go viral. Check out these 5 controversial ad examples and what you can learn from them. https://t.co/gaM6v43ajr", "2019-06-29 00:53:05"], ["Calling all brick and mortar business owners - check out our tips for optimizing your business listing on Google Maps and crawling your way to the top of local search results. https://t.co/C6NuZn9VqM", "2019-06-28 17:47:04"], ["A call-to-action should act as a GPS for your website visitors – check out these 5 tips to writing killer CTAs. https://t.co/flActOrqJa", "2019-06-27 20:15:04"], ["🎉 Beyond thrilled to be included as a finalist for @ThinkLA Partner of the Year! #ThinkAwards #AllEyesOnYou https://t.co/tCIcGGbh93", "2019-04-24 21:30:59"], ["Your value prop should flaunt your best attributes (ideally one attribute that's simple and easy to understand) – here are some examples. https://t.co/NaJe4xUWf0", "2019-04-23 21:36:04"], ["Search isn't just for Google anymore – are you optimizing for Facebook search? https://t.co/xtojxWyqRG", "2019-04-22 21:26:01"], ["Your social media calendar could use some honest, expert tips. Here's 30 of them. https://t.co/jg2V28bSj5", "2019-04-19 20:10:04"], ["Ready to dive into the archive? Finding your old tweets might be easier than you think. https://t.co/YdT12TizbH", "2019-04-15 19:54:02"], ["Props to our own Imran Sheikh, who will be speaking at Draper University's Hero Training, lending some wisdom about success, failure, and expectations (in business and in life!)  https://t.co/0Wkp8KUOBo", "2019-04-05 17:56:05"], ["Algorithm reality check! We asked the experts to break down IG fact &amp; fiction for us. https://t.co/scn4v490I9", "2019-03-22 22:08:04"], ["Don't forget to introduce yourself! And if you're a business, there's a whole lot more you can leverage when it comes to IG bios. https://t.co/tePZTDOjCd", "2019-03-14 22:10:04"], ["There's more than one way to size up your Instagram video content these days, so we thought we'd give you a full rundown. https://t.co/Fd45FkTBpD", "2019-03-13 20:24:04"], ["A little competition can go a long way for your followers – be sure you're making the most of your giveaways. https://t.co/c6cbPyXzus", "2019-03-12 17:02:04"], ["Thanks to @FitSmallBiz for rounding up these LinkedIn pro tips – and shoutout to our own  Zoe Black, who's one of the pros featured! https://t.co/8WH3mEosnF", "2019-03-05 20:11:19"], ["We're always looking toward the future of data, which is why we're excited to be a part of aqfer's Marketplace! @aqferinc https://t.co/JNT2uc9zn2", "2019-03-01 23:51:03"], ["Don't throw around the word 'algorithm' without knowing what it really means – and how it can help you. https://t.co/DmnBnhizj9", "2019-03-01 18:34:06"], ["Does your FB feed belong on your website? Here's how to make it happen. https://t.co/JTHTsz1lTJ", "2019-03-01 01:25:06"], ["We're honored to be included on the list of 2019 Best Workplaces in the Bay Area! https://t.co/YEMHXOOTS6", "2019-02-28 21:28:04"], ["Instagram is here to say – take a dive into who's actually double tapping their way through the platform. https://t.co/tUcdBkaDdI", "2019-02-28 18:22:05"], ["There's no doubt Instagram is a heavyweight in marketing – now how about Instagram as PR? (c/o @SpinSucks) https://t.co/f7qqFLSnBt", "2019-02-02 01:49:02"], ["Micro-influencers = macro-impact! Props to our own Zoe Black for this post on G2 Crowd on how to make the most of influencer marketing on a tight budget: https://t.co/i7OssZuxlX", "2019-01-31 05:55:01"], ["New year, new social trends! Make sure your 2019 social media strategy is changing with the times. https://t.co/rK1xfiIE0l", "2019-01-25 18:21:04"], ["Building a brand on Instagram starts with building a rock-solid marketing strategy – what's yours? https://t.co/RT908Iynti", "2019-01-04 20:25:06"], ["Are you tracking the right social metrics? Review &amp; revise your methods often to keep things fresh and growing. https://t.co/5WuGCFhcl7", "2018-12-20 23:50:04"], ["They're not as scary as they sound – but you should probably still know what they are. https://t.co/GuiOQP93Vt", "2018-12-18 23:38:02"], ["Not sure where to start with your Snapchat Business account? Let the pros help you out. https://t.co/mnmfwRGq7y", "2018-12-17 21:41:04"], ["Get your social accounts into tip top shape with a good old-fashioned social media audit! https://t.co/hfmW4mNypu", "2018-12-13 23:43:02"], ["There's no one way to make a memorable first impression with your Facebook cover photo – so here are 50. https://t.co/F5PC8moAZ5", "2018-12-12 23:06:04"], ["Help your future subscribers find you! Start with a quick SEO boost and a multi-channel promotional approach. https://t.co/KIB1kUPJOl", "2018-12-01 01:05:05"], ["Looking for new ways to shake up the inbox? Get inspired by this roundup of stand-out newsletters. https://t.co/oIwrkmC3RJ", "2018-11-29 23:40:01"], ["Want your brand to stand out on social? Start by becoming an active, respectful, and attentive listener. https://t.co/CMI28GhGgp", "2018-11-26 20:51:02"], ["Brush up on the details of impressions vs. reach vs. engagement – and how to make the most of all of them! https://t.co/9FYzW0xvqw", "2018-11-20 21:47:03"], ["Facebook is a crowded space for businesses, and growing every day – how will your brand stand out from the rest? https://t.co/LoBhmAc7jb", "2018-11-15 20:16:01"], ["Helpful reminder from @smallbiztrends that spreading your content far &amp; wide may mean going beyond the usual social media channels. https://t.co/NUPvxvgmsu", "2018-11-13 22:32:02"], ["Looking to turn hopeful prospects into eager clients? It all starts with a killer social media proposal. https://t.co/kF2GS75Ta2", "2018-11-08 21:54:04"], ["'One marketer's trash is another's treasure.' – Check out this gem &amp; more from our 'data czar,' @RobFinora in @TMQ_Magazine https://t.co/viVMH7QOep", "2018-11-06 20:11:04"], ["Looking for that secret passageway to where your audience is hanging out? Hashtags were made for just that purpose, so be sure you're making the most of them. https://t.co/xFimrblwbA", "2018-11-02 00:26:05"], ["Answering your burning questions about how to earn that blue badge of honor for your Instagram profile. https://t.co/ubS8cgyxMd", "2018-10-31 19:05:05"], ["Need a crash course in influencer marketing? Start with this guide before you spend valuable marketing $$ on #SponCon. https://t.co/4zmWmGS27T", "2018-10-30 20:22:04"], ["From SEO expertise to graphic design fluency, these marketing skills should find their way onto your resume, according to the pros. https://t.co/jfGtIRWgBR", "2018-10-25 01:46:04"], ["Feeling excited &amp; humbled over here! Thanks to @FortuneMagazine for the distinction, and thanks especially to the whole team at ShareThis for making this a fantastic place to come to work every day. https://t.co/1eB7HYO2NL", "2018-10-18 19:28:01"], ["What do you need to do to earn that highly coveted blue checkmark? Read up on the application process here. https://t.co/zc2hzGsus8", "2018-10-16 22:01:05"], ["Get your users to hit that share button! Props to @B2Community for these tips. https://t.co/b0O3kxzbiq", "2018-10-09 15:18:30"], ["\"Tell the complete story in the fewest possible words\" – learn to be concise &amp; powerful with your social media posts. https://t.co/Msuscy76OZ", "2018-10-03 02:36:50"], ["Congratulations to our CEO, Dana Hayes, Jr., for moderating an exciting panel on \"The New Rules of Data\" with @adweek today! https://t.co/QCzs43v1xZ", "2018-10-02 20:22:48"], ["Facebook ad spend is a moving target – check out these tips for how to take the reins and make those ad dollars last. https://t.co/YflIy9ddy4", "2018-10-01 21:22:02"], ["Want to tune in to the latest tips &amp; trends in the world of marketing? Add these podcasts to your regular lineup. https://t.co/v5Xp0Tzssi", "2018-09-29 00:58:05"], ["Did you know your Facebook cover photo is being auto-cropped across devices? Design your pic with these specs in mind. https://t.co/pLxWFML0TF", "2018-09-27 19:30:04"], ["Your blog can't write itself...or can it? Check out these tips for how to mine relevant blog topics, rinse, &amp; repeat. https://t.co/d1ITfUmso6", "2018-08-29 22:53:04"], ["Your event makes a first impression long before anyone shows up – make it count with a perfect Facebook event photo. https://t.co/5N44fwVjfp", "2018-08-21 18:23:04"], ["Reposting on Instagram is no easy feat! Don't get caught off guard next time #TBT rolls around. https://t.co/dYpsK57haz", "2018-08-17 19:12:03"], ["According to the pros, buying followers is bad news – here's how experts divvy their Twitter resources. https://t.co/b9GsYUQ3nf", "2018-08-16 19:32:03"], ["Let your audience share your most stunning visual content with the world – introducing: Image Share Buttons. https://t.co/RTZxH4Lpgq", "2018-08-14 18:16:01"], ["Need a rest from the social media juggling act? Breathe a sigh of relief with these powerful &amp; timesaving tools. https://t.co/0JnF5U8X5b", "2018-08-06 18:50:04"], ["Watch your open rates skyrocket thanks to a few 'power words' here and there. Choose them wisely! https://t.co/IK4SN6Y0Mk", "2018-08-03 16:08:04"], ["Not all Instagram profile photos are created equal – but they are all the same size. Does yours measure up? https://t.co/VhsCvy93yr", "2018-07-31 22:55:03"], ["Not sure what makes a perfect Facebook cover photo? We've rounded up a few examples that come pretty close. https://t.co/8gwMnFM4fp", "2018-07-30 19:20:05"], ["Point your audience to your most important Facebook content, without spending a dime on advertising. https://t.co/ilgW4JhQia", "2018-07-25 17:58:06"], ["What should you really look at with Instagram analytics? (Hint: it's not your follower count!)  https://t.co/BkwQjohrIN", "2018-07-18 22:58:01"], ["Tune in to @ThriveLouD to hear our own @kurtabra weigh in on everything from the social data landscape to life advice for young professionals. https://t.co/q6vGP4I1dv", "2018-07-12 21:41:02"], ["If you spend on Facebook, you (probably) should spend on Instagram – some tips to stretch your double-tap dollars: https://t.co/wiKq75ZK69", "2018-06-30 21:54:02"], ["A helpful reminder that digital marketing is still a multi-channel balancing act – even with tightening restrictions on social platforms. https://t.co/WB0PMis3L1", "2018-06-29 16:52:01"], ["Is your Twitter header making the right first impression? Check out these tips to make your header image pop. https://t.co/EH5ZvR2uFR", "2018-06-20 19:59:06"], ["How does GDPR affect you and the platforms you use? Stay up to date with these tips and questions. https://t.co/ixBkYSoWWi", "2018-06-18 21:04:06"], ["Yes, there is an ideal time to post to Instagram – but why not let these IG schedulers watch the clock for you? https://t.co/vC4zBo20qS", "2018-06-15 21:51:03"], ["Thrilled to partner with @analyticsiq and @LiveRamp to bring you the most powerful digital audiences on the market. https://t.co/xI6QaHQJFS https://t.co/73t7WvqG2g", "2018-06-13 19:58:03"], ["Cheering on our west coast sales rockstar, Denise Shipley! https://t.co/C6q7og97hx", "2018-06-07 23:39:53"], ["Facebook Audience Insights can bring you closer than ever to your audience – get started with these expert tips. https://t.co/vsOhjysOmB", "2018-06-07 19:07:03"], ["A warm welcome to CEO, Dana Hayes, Jr., and new data partners, as we continue to pioneer sharing intelligence. https://t.co/BGbjLP0Z0P", "2018-06-06 16:48:01"], ["Overwhelmed by algorithm changes, new media channels, and evolving social trends? Let these experts help you keep up. https://t.co/mNH6FCBy2l", "2018-06-05 16:57:04"], ["Calling all budding bloggers! Choose your platform wisely with our breakdown of @Wordpress, @Weebly, and @Blogger. https://t.co/jwMQBuPY5B", "2018-06-01 19:02:01"], ["May 25th deadline? Check. GDPR officially in effect? Check. Your GPDR compliance? Make sure with this guide. https://t.co/THQpIqMKZS", "2018-05-31 16:19:04"], ["Want to move your site into the fast lane? Check out tips from the pros on how to promote your blog content wisely: https://t.co/pfu9yU7hf9", "2018-05-29 19:27:05"], ["GDPR compliance is the talk of the town right now – we built a streamlined tool to help you comply.  https://t.co/YRWp1j17ym", "2018-05-25 16:10:01"], ["Helpful insights on how to reach your audience exactly where and when they’re ready to engage, in the era of chatbots, Alexa, and ‘going live’ (@WebEngage) https://t.co/MkCoxE2qzn", "2018-05-22 13:48:32"], ["Are you using Twitter GIFs right? Here's everything you need to know to set your tweets into motion. https://t.co/qOB0Q65Ihi https://t.co/ciLfQbQxJv", "2018-05-21 18:00:07"], ["Don't let your first impression be your last – check out 7 awesome welcome emails from @Starbucks, @Away, and more: https://t.co/gmshy08bc1 https://t.co/fCpzhQoohE", "2018-05-18 21:43:05"], ["Why does microblogging matter in 2018? Check out this rundown from @socialnomics: https://t.co/kh1KnqegZ2", "2018-05-17 21:44:02"], ["Understanding your audience just got easier (and way more visual) – check out our new Social Analytics Dashboard: https://t.co/xW5wOWPoED https://t.co/gc0gE10HiT", "2018-05-16 19:56:02"], ["Major brands like @Aerie and @CalvinKlein rely on authentic user-generated content to build awareness - here's how: https://t.co/1kb6e3B8gv", "2018-05-11 21:26:04"], ["To square or not to square? Read the latest on Instagram dimensions in 2018. https://t.co/YNsHcvYb1x", "2018-05-11 17:55:44"], ["Are you using WhatsApp to drive referral traffic to your site? If not, you're missing out on a huge opportunity! https://t.co/xnaZflEQ53 https://t.co/QRmrQyR4zj", "2018-05-02 16:44:49"], ["Do you want to boost your social media and content strategy in 2018? These events can help. 😉 https://t.co/iftH6Yesid", "2018-05-02 15:29:31"], ["It’s easy to create a Snapchat Geofilter that catches people’s attention. Simply follow these steps.  https://t.co/pfwDlUYEA5 https://t.co/g4P9zYkE8W", "2018-04-30 17:19:44"], ["What are some creative ways to get more Twitter followers? 20 experts share their secrets. https://t.co/fygn2EKkMI https://t.co/QWzDhzB64T", "2018-04-30 14:36:09"], ["Find out how the world’s most creative marketers like @CocaCola grow their Twitter followers #TwitterTips https://t.co/fygn2EKkMI", "2018-04-27 17:24:15"], ["Many brands like @McDonalds and @Grubhub are using Snapchat Geofilters to engage their audience in innovative ways. Here’s how to make one. 👉https://t.co/pfwDlVgfrD", "2018-04-25 14:53:50"], ["We're so proud that our very own Denise Shipley is a finalist for #ThinkAwards \"Salesperson of the Year\"! Go Denise! https://t.co/uOvsctpCIZ", "2018-04-24 20:06:04"], ["How do social signals impact SEO? 🧐50 experts tell all. https://t.co/ziJskYlpAm", "2018-04-24 14:22:37"], ["How can you leverage your social media channels to grow SEO? 🤔 50 experts tell all. https://t.co/ziJskYlpAm", "2018-04-19 14:08:45"], ["People do judge a book by its cover. Don't let a bad image choice detract from your social media presence. https://t.co/utPoSRGrEd https://t.co/ARQTIqXXUV", "2018-04-18 17:51:45"], ["Want to set up an Instagram giveaway but don’t know how? Check out eight stellar examples that get results 👍 #instagramtips https://t.co/b6i6ozrmNF", "2018-04-18 14:43:49"], ["Running a giveaway on Instagram is a great way to drive engagement. 😍 Check out 8 amazing examples of Instagram giveaways. #instagramtips\nhttps://t.co/b6i6ozrmNF", "2018-04-12 14:24:15"], ["We’re excited to launch our follow buttons for WordPress! Start growing your community of followers today!\nhttps://t.co/WbczVIugdP", "2018-04-11 20:25:50"], ["Facebook’s banishing of third-party data is affecting everyone in the marketing supply chain. Our CEO @kurtabra rounded up the winners and losers in this @adexchanger piece. https://t.co/O5JI7UgxGK", "2018-04-11 14:15:41"], ["@IharaDojoUK hi @IharaDojoUK Actually, you can add the Twitter follow button on your website to get more Twitter followers. You can remove it from the platform once you sign up.", "2018-04-02 20:09:26"], ["Our very own Denise Shipley is the Salesperson of the Year finalist for #ThinkLA Award! Please vote for her on this page: https://t.co/pPPPYTGfqJ https://t.co/lY1pvO5trJ", "2018-04-02 20:07:58"], ["Want to master the art of copywriting to attract more followers and customers? Don’t miss out on these free courses. https://t.co/ZapJbYx7sL https://t.co/j6QuCaIfzB", "2018-03-29 14:15:33"], ["Want to create content that sells? Check out our list of the best free copywriting courses!\nhttps://t.co/ZapJbYx7sL", "2018-03-28 15:28:55"], ["Having a hard time increasing your Facebook following?  Check out these #FacebookMarketing strategies.  https://t.co/EGdIBfVA8T https://t.co/Jay6nqZIEw", "2018-03-26 14:36:31"], ["How can today’s CMOs make more informed decisions about AI? Our President Dana Hayes Jr. explains how AI could be used to solve key pain points and improve performance\nhttps://t.co/g93uHwxCIl", "2018-03-23 17:51:25"], ["Learn how top brands like @Dove and @Nike increased 🚀 their Facebook followers with these #FacebookMarketing strategies.  https://t.co/EGdIBfVA8T", "2018-03-23 14:35:03"], ["Picking the best time to post on Instagram is a great first step in getting more engagement. Check out our #instagramtips. https://t.co/j5vWnyXd7T https://t.co/ZWsh3IMbZH", "2018-03-22 14:21:41"], ["Not getting enough Instagram followers and engagement for your posts? 😬 Check out our #instagramtips on the best time to post. 👉 https://t.co/j5vWnyXd7T", "2018-03-21 14:27:16"], ["You can't have an effective #Facebook post without the right image.  https://t.co/siwBkqvnqd https://t.co/04xMQ269Gl", "2018-03-15 15:25:28"], ["Struggling to grow social traffic? Here’s how you can use WhatsApp --- an untapped goldmine of referral traffic 👉 https://t.co/9Nxk0c8Aia", "2018-03-15 13:59:43"], ["From Twitter to Instagram, here's the one-stop guide for the perfect social media image sizes. https://t.co/utPoSRGrEd https://t.co/vIbexoDsYA", "2018-03-14 14:58:07"], ["People do judge a book by its cover. 🧐Don't let a bad image choice detract from your social media presence. https://t.co/utPoSRGrEd", "2018-03-13 14:50:03"], ["Find out how brands like @Nike and @heymamaco use quotes on Instagram to grow their following. #InstagramTips  https://t.co/MPBP3CgHqh", "2018-03-08 14:59:49"], ["Using quotes on Instagram is a great way to grow your following. We’ve rounded up 4 types of Instagram quotes that go viral. 🚀  #InstagramTips\nhttps://t.co/MPBP3CgHqh", "2018-03-07 15:57:24"], ["Find out where you can meet @jaybaer in person this year 👉 https://t.co/iftH6Yesid", "2018-03-06 21:42:19"], ["Find out where you can meet Ann @MarketingProfs in person this year 👉 https://t.co/iftH6Yesid", "2018-03-06 21:40:21"], ["Find out where you can meet @GuyKawasaki in person this year 👉 https://t.co/iftH6Yesid", "2018-03-06 21:37:26"], ["Here are 25 simple ways to get more @Pinterest followers 😉 https://t.co/q6ya7FA1jx", "2018-03-06 21:34:19"], ["Want to effortlessly get more Pinterest followers?  Check out these tips and tricks! 👉\nhttps://t.co/q6ya7FA1jx", "2018-03-06 15:15:20"], ["@_ko_mon Hmm that's strange. When you click on the orange button, it should take you to this page: https://t.co/MNDiwyqqyU\n\nIf you're still having issues, please take a screenshot and email our support team at support@sharethis.com. Thanks!", "2018-03-06 15:14:23"], ["Are you using these strategies to maximize your presence on Pinterest? 😉\nhttps://t.co/q6ya7FA1jx", "2018-03-05 15:55:26"], ["@_ko_mon hi there, can you explain more about what's not working? Would be happy to help 🙂", "2018-03-05 15:36:52"], ["We’re so proud to be chosen by @FortuneMagazine and @GPTW_US as one of the Best Workplaces in the Bay Area!  Thanks to our entire team for making ShareThis a wonderful place to work! 👍\nhttps://t.co/56a9P6jSa2", "2018-03-02 18:46:08"], ["Want more Twitter followers? Try installing our NEW Twitter follow button! 😉\nhttps://t.co/wvRytLk2ff https://t.co/coouSnDcXH", "2018-03-02 15:34:19"], ["Looking for an easy way to grow 📈 social following? Try our NEW follow buttons! \nhttps://t.co/5T5WRglllk", "2018-03-01 21:27:18"], ["Conference alert! 👉 top social media and content marketing events to attend in 2018 https://t.co/iftH6Yesid", "2018-02-27 15:48:56"], ["Do you want to boost your social media and content strategy in 2018? These events can help. https://t.co/iftH6Yesid https://t.co/gCtPHKJ5rU", "2018-02-26 15:29:01"], ["Want to meet the best content marketers and social media gurus? You can take advantage of these events. https://t.co/iftH6Yesid https://t.co/SM9gCqwcBX", "2018-02-23 19:06:20"], ["Check out the #boundlesspod -a podcast that talks with the freelancers and innovators creating the #futureofwork https://t.co/wBEnSnM8qh cc:@p_millerd", "2018-02-23 18:00:46"], ["Looking to 📈 the effectiveness of your Facebook posts? We've got 3 surefire strategies for picking the perfect image.  https://t.co/sc1iTnkd8V", "2018-02-15 21:54:20"], ["With #gdpr fast approaching, Our Chief Product Officer Ann Kennedy shared 3 strategies for thriving in a post-GDPR world. https://t.co/eBzFPfyN8w", "2018-02-15 15:04:46"], ["Why social signals and SEO ranking go hand in hand. 👫 https://t.co/htSxOaHtuu", "2018-02-14 19:33:53"], ["How do you know which share buttons to use? Ask yourself these 3 questions. https://t.co/Y9PBeG8d1F", "2018-02-14 16:17:13"], ["Happy #ValentinesDay2018 ! 💗\nhttps://t.co/YC4ZLA92bL", "2018-02-14 15:02:29"], ["Better intro copy = more 😍 for your Facebook post! \nhttps://t.co/TmhcFFt5sM", "2018-02-13 21:22:33"], ["It's time to supercharge your 2018 content marketing strategy! 🚀 https://t.co/F1zKrfYRLI", "2018-02-13 19:55:39"], ["Which social network generated the most shares around #ValentinesDay?  #sharingintelligence https://t.co/YC4ZLA92bL https://t.co/LX9IkdHJtN", "2018-02-13 15:25:33"], ["#ValentinesDay is next week! Use #sharingintelligence insights to win over the hearts of your customers! https://t.co/YC4ZLA92bL", "2018-02-09 14:45:31"], ["Ready to take your Facebook strategy up a notch? Try these 7 tactics: https://t.co/08J56ktPor https://t.co/Tt40CWIDWw", "2018-02-08 20:02:03"], ["Shares are your greatest social currency. Get rich with these tips: https://t.co/IDSEHATTM7 https://t.co/BMW01b90kL", "2018-02-08 19:58:07"], ["If shares are like gold, these rockstars own the mines: https://t.co/YMiqHtHtpH https://t.co/oEXQ6pu6ct", "2018-02-08 15:55:30"], ["1/2 your visitors read less than 15 seconds: 6 tips to keep them longer: https://t.co/SrNyN9mWxV https://t.co/ykQaDbWzUr", "2018-02-08 14:48:54"], ["Running out of ideas for your blog? Learn how experts keep their ideas flowing!  https://t.co/vNVRsemfFp https://t.co/YAKJWfeZ1i", "2018-02-07 19:06:40"], ["#ValentinesDay is coming soon! Use #sharingintelligence insights to win over the hearts of your customers! https://t.co/YC4ZLA92bL https://t.co/GC4cQCF1mV", "2018-02-07 15:51:56"], ["What kind of content gets the most love from the #ValentinesDay audience? Check out these #sharingintelligence insights. https://t.co/YC4ZLA92bL https://t.co/DcfGW9kteo", "2018-02-06 15:16:10"], ["Here’s how you can make your Facebook ads stand out to your potential clients https://t.co/9b3BP8iqR2", "2018-02-02 18:59:27"], ["Location, location, location! Why it’s important to know where to place the share buttons on your site. https://t.co/6ytl6NtYSy https://t.co/UjmwEBYIxQ", "2018-02-01 20:27:49"], ["Struggling to rank high in SEO? Your content needs more social shares. https://t.co/wkIuP3qkc2 https://t.co/yKGQnPwSWQ", "2018-02-01 15:37:13"], ["@GoKeywee - Love your blog post about @facebook news feed update 👍and included your insights and tips in our post: https://t.co/641BBLmv36", "2018-01-31 22:14:21"], ["@amontalenti - Love your insight into referral traffic sources, quoted you in our blog post:  https://t.co/641BBLmv36", "2018-01-31 21:21:05"], ["We agree with @Mention that influencer marketing is the winner of Facebook algorithm change: https://t.co/641BBLmv36", "2018-01-31 21:17:14"], ["Shares are your greatest social currency. Get rich with these tips.  https://t.co/IDSEHATTM7 https://t.co/eLGUBYr5eT", "2018-01-30 18:41:21"], ["@nberke - Love your MediaShift piece about @facebook news feed change, quoted you in our blog post: https://t.co/641BBLmv36", "2018-01-30 16:40:36"], ["How can you increase your social shares? First, choose the right share buttons.  https://t.co/Y9PBeG8d1F https://t.co/gtar8xJ74e", "2018-01-30 16:31:51"], ["Facebook's algorithm change isn't all bad news. Here's why.  https://t.co/1estAhN2m4", "2018-01-30 15:23:49"], ["1/2 your visitors read less than 15 seconds. Try these 6 tips to keep them longer. https://t.co/SrNyN9mWxV https://t.co/Pql0Az46vJ", "2018-01-29 18:38:55"], ["Unsure which design to choose for your share buttons?  Find out the most trendy share button styles right now.  https://t.co/YJFT1PxxU1 https://t.co/r4aXBxwMox", "2018-01-29 16:05:06"], ["Here's how you can take advantage of this social platform that boasts more than 1 billion users https://t.co/TedcCWeh1U https://t.co/OLflt681WY", "2018-01-29 14:49:54"], ["Want to grow your email list in 2018? Your blog is your best bet. Start with these 3 simple staples: https://t.co/jr1vuiUb3G https://t.co/qTl5WV1AzP", "2018-01-26 22:36:34"], ["Coming up with ideas for blog posts is more difficult than meets the eye. Take a page from the experts! https://t.co/vNVRsemfFp", "2018-01-26 18:43:16"], ["How do people share differently in private vs. public? Check out the surprising results in our latest report. https://t.co/CTXFbYSeod https://t.co/RVHBuBbT7P", "2018-01-26 15:50:41"], ["Want to encourage more people to share your content? Make it easy for them with optimized sharing tools! https://t.co/ST28OPKNiv", "2018-01-25 20:50:33"], ["Here’s everything you need to know about creating Private @Flipboard Magazine: https://t.co/pHCwoORfAd", "2018-01-25 18:53:20"], ["Are you trying to boost your content marketing strategy for 2018? If so, don’t miss out on these 10 experts’ advice!  \nhttps://t.co/F1zKrfYRLI https://t.co/jh6Pq1pbNK", "2018-01-25 15:07:05"], ["Check out these great tips from @Flipboard on how to share your content privately! https://t.co/FRtXtXv2Lk https://t.co/vnxeG0cqo7", "2018-01-24 18:23:55"], ["Here’s how to encourage engagement with a share-friendly blog! https://t.co/G3ZO7gEuml", "2018-01-24 15:57:39"], ["We agree with @nberke that publishers need to emphasize and optimize their sharing strategy to combat #Facebookchanges   https://t.co/8bc7AsPVcI", "2018-01-19 16:30:33"], ["Looking to innovate your data marketing strategy this year? Our Chief Product Officer Ann Kennedy offers advice to marketers in her interview with @LiveRamp.  https://t.co/SgHWg2wRAr", "2018-01-18 19:03:59"], ["Data transparency and quality are what keep marketers up at night. Our SVP of Data @Robfinora explained how marketers can get clean, high-quality data in this AdExchanger article: https://t.co/5HXU9Nz6QE", "2018-01-05 14:35:27"], ["Let’s kick off 2018 by taking a look back at what we’ve learned from the 1.1 billion social shares in 2017 #EndOfYearReview! https://t.co/yJ69VegNAY", "2018-01-04 18:55:37"], ["Something to think about for 2018 😉 https://t.co/dKNIxK83EG", "2018-01-03 15:02:18"], ["Happy New Year! You can start off the year strong with these 10 experts' advice for content marketing! https://t.co/F1zKrfYRLI", "2018-01-02 20:05:08"], ["Thanks @contently for featuring our Dark Social White Paper on their blog! Check it out here: https://t.co/fKOx5bDc8T", "2018-01-02 15:43:16"], ["@contently featured our Dark Social White Paper on their blog! Check it out here: https://t.co/ROLsFDcXiN", "2017-12-26 18:56:46"], ["Attention publishers: Don’t get caught up in chasing the shiny objects! Instead, focus on these practices to succeed. https://t.co/5NMyEDTd6i", "2017-12-21 21:41:51"], ["Are you planning for 2018? If so, don’t miss out on these 10 experts’ advice to 🚀 your 2018 content marketing strategy!  https://t.co/F1zKrfYRLI", "2017-12-21 20:51:29"], ["It’s time to give your business a digital presence. Learn how to create your own website by taking these 4 simple steps. https://t.co/izw2tZ2eBn", "2017-12-20 19:00:44"], ["What Are 2018’s Biggest Content Marketing Trends? via @contently https://t.co/sBAKYdTzka", "2017-12-15 14:48:17"], ["Want to curate and share awesome content in one single place, all while building your network and collaborating with others? Check out these 4 tips on how to get the most out of @Flipboard: https://t.co/Xy2lwbnVmW", "2017-12-15 14:40:10"], ["Looking to grow your website and business in 2018? Check out these 10 experts’ advice to improve your 2018 content marketing strategy!\nhttps://t.co/F1zKrfYRLI", "2017-12-14 18:43:19"], ["Data is ubiquitous and massive, but how can marketers best leverage it to their advantage? Our president Dana Hayes offers some advice for marketers to succeed in a data-overload world. https://t.co/LCmO1ULECC", "2017-12-14 16:30:45"], ["Happy holidays! ShareThis teams across regions are celebrating the holiday season with different events. What’s your favorite #holiday activity?  #HolidayIsHappening https://t.co/28lFBm5haX", "2017-12-13 18:31:07"], ["We’re proud to be awarded the @tag_today Anti-Fraud Seal alongside @facebook, @amazon, and 23 other industry leaders. https://t.co/46ykK3fCM7", "2017-12-11 16:54:07"], ["People display different behaviors in public vs. private sharing. Check out the fascinating insights in our latest whitepaper. https://t.co/CTXFbYSeod", "2017-12-05 14:45:10"], ["There's a hidden world of social sharing happening online. Uncover mind-blowing insights through our latest whitepaper.🧐  https://t.co/CCIVoMHaOb", "2017-12-01 20:22:14"], ["We’re incredibly proud to win a three-peat of #bestplacetowork awards by @BestinBizAwards, @FortuneMagazine, and @Adage: https://t.co/Lls3VfUBhh", "2017-11-29 18:27:33"], ["Not getting much love from your fans? Check out these 6 #copywriting tips on how to drive more Facebook shares.\nhttps://t.co/caoNUNKTjL", "2017-11-29 15:48:01"], ["You can turn your blog into a lead generating machine using these 3 tips!\nhttps://t.co/jr1vuiUb3G https://t.co/AB7qFksfDm", "2017-11-28 15:17:51"], ["Torn in choosing between PPC and social media marketing? Here are the ways you can make these two marketing strategies go hand in hand. https://t.co/E2CEJRmYRH https://t.co/LufBNj2BGd", "2017-11-22 15:39:47"], ["Email is *still* a dominant sharing tool--add the button to increase referral traffic to your site!  https://t.co/T4cazj7QFA", "2017-11-21 16:41:39"], ["Need a new way to engage your FB Audience? Here's how to reach them through Messenger Ads  https://t.co/RVrO6M1SBx", "2017-11-16 16:15:00"], ["Are you using WhatsApp to drive referral traffic to your site? If not, you're missing out on a huge opportunity! \n\nhttps://t.co/48FMao8iXD", "2017-11-15 15:16:30"], ["Our SVP @pclentz shared with @flipboard how publishers can leverage the power of curation to drive more social shares https://t.co/E5vEbXrqe2", "2017-11-14 17:02:51"], ["We're incredibly proud and honored to rank #10 on @adage’s 2017 Best Places to Work list!\nhttps://t.co/IJXSuvsX6k", "2017-11-13 19:10:27"], ["Your blog is your best bet to grow your email list in 2018. 😉 Start with these 3 staples. https://t.co/DVLKbo0cpV", "2017-11-07 15:50:00"], ["Make sure your WordPress site is a lean, mean, properly coded machine 💪! https://t.co/pklOUtXRK5", "2017-11-06 20:03:13"], ["Here’s how you can use WhatsApp --- an untapped goldmine of referral traffic --- to grow your site: https://t.co/uzfYP77xV6", "2017-11-01 15:35:48"], ["You can increase your reach and improve the curating experience with these 3 tips. https://t.co/iS2qtHNn6V", "2017-10-25 18:20:45"], ["Running out of ideas for your blog? Learn how experts keep their ideas flowing!  https://t.co/vNVRsemfFp", "2017-10-24 15:31:07"], ["LinkedIn recently introduced native videos. Here's why this new feature is worth investing your time 🧐:  https://t.co/tds1QjDZmi", "2017-10-19 17:39:27"], ["How does B2B Facebook Advertising work? A comprehensive guide uncovering the best ways to catch a business’s eye https://t.co/y2e8STr8rI", "2017-10-18 15:32:43"], ["thank you! @polksbc1 https://t.co/wUh3MiXAp1", "2017-10-17 20:11:01"], ["Thrilled to receive the honor from Fortune as one of the Best Small Workplaces! https://t.co/ib4KU7pwzF https://t.co/Zb4cHB2kuh", "2017-10-17 16:41:45"], ["These WordPress plugins will quickly help you attract new readers and get more love from existing ones! https://t.co/WSw0dVwIGn", "2017-10-16 17:40:58"], ["Our CEO @kurtabra offered an insider perspective and vision for the future with #CEOpeek https://t.co/gugrSlDd4B https://t.co/QKOV2CLIwD", "2017-10-10 14:13:33"], ["10 tips to help your business and blog win on Pinterest https://t.co/DJc3k0reO4", "2017-09-26 15:12:20"], ["@svenclarkster It could be. Good call!", "2017-09-25 14:20:10"], ["These nominees received the most positive and negative sentiment in our pre-Emmys insights.  But this sentiment has shifted after the show! https://t.co/etZQAvAVUr", "2017-09-22 19:28:09"], ["Get a leg up in Facebook shares with these 6 #copywriting tips  https://t.co/eaX2Vg6jZQ https://t.co/rNlZ3r0ljN", "2017-09-19 14:37:24"], ["Emmy’s Award is right around the corner! Guess which TV shows are dominating the social buzz? #SharingIntelligence https://t.co/CruhrdgbaR", "2017-09-15 19:16:31"], ["If shares are like gold, these rockstars own the mines 💪 \nhttps://t.co/YMiqHtHtpH", "2017-09-15 14:29:42"], ["Social traffic is vital to the success of your blog.  🚀 it with these 4 simple actions. https://t.co/3zNHBX6zb8", "2017-09-14 18:52:12"], ["Fast, intuitive, and beautiful -- introducing our new Share Button plugin for WordPress! https://t.co/S78JrEfYxD", "2017-09-12 14:32:37"], ["It's time to add Flipboard share button to your social marketing toolkit!  https://t.co/u9KjkoT5tT", "2017-09-11 14:35:30"], ["@carnivalosouls thanks for the brand mention in your blog post: https://t.co/x7hPRaX2LB happy to share our insight on dark social with you!", "2017-09-08 18:43:38"], ["@carnivalosouls thanks for the brand mention in your blog post! Happy to share our insight on dark social with you.  https://t.co/x7hPRaX2LB", "2017-09-08 18:42:10"], ["1/2 your visitors read less than 15 seconds: 6 tips to keep them longer\nhttps://t.co/SrNyN9mWxV", "2017-09-08 14:48:50"], ["We can't agree more! -- Why Content Strategists Take Social Shares Seriously (And You Should Too) via @contently https://t.co/6drqt9wE9Y", "2017-09-07 15:47:37"], ["Is your mobile site leaking traffic? Try sprucing up your navigation\nhttps://t.co/UYyI4mtsQ7 https://t.co/idOKqpSd63", "2017-09-06 14:11:22"], ["Improving the customer journey takes the right type of data. Our President Dana Hayes, Jr. shared some advice: https://t.co/2VeRGzXMmh https://t.co/6SVUehBtf9", "2017-09-05 15:46:29"], ["What if people don't want to broadcast everything they read to the world?  https://t.co/LAG0xzCu34", "2017-09-05 14:04:41"], ["So proud of our CEO @kurtabra for being chosen as #TimmyAwards finalist - here’s why he deserves to win: https://t.co/XQuTvxsyn4", "2017-09-01 13:55:06"], ["You’ve worked so hard to make a good site. Don’t let it be ruined by bad links. https://t.co/qlc61apcqN https://t.co/E9L8aAaL3L", "2017-08-31 13:59:41"], ["Location, location, location! Why it’s important to know where to place the share buttons on your site. https://t.co/6ytl6NtYSy", "2017-08-30 14:02:54"], ["Our CEO @kurtabra is a Best Tech Manager finalist for #TimmyAwards! Vote for him by giving him a thumbs up https://t.co/uPrTnNQ2Jv https://t.co/VP26kja02j", "2017-08-29 17:59:37"], ["Sharing is easy. Installing share buttons should be, too! Here's our guide for Weebly:  https://t.co/nX2wtjRKVw", "2017-08-10 14:05:58"], ["Privacy today is more valuable than ever. \"Private\" share buttons can help. https://t.co/3d0YW1HusE", "2017-08-09 14:11:58"], ["A Simple Step-By-Step Guide To Install Share Buttons On Squarespace.\nhttps://t.co/GKzIS62iUx", "2017-08-08 13:45:32"], ["Do you run a Wix site? Install social share buttons with these simple steps:\n https://t.co/2nICsIRma3", "2017-08-07 14:33:44"], ["How social signals can drive your site’s search volume skyward: https://t.co/wkIuP3qkc2", "2017-08-04 14:13:10"], ["5 Ways to Turn Pinterest Into A Great Source Of Website Traffic:  https://t.co/YKt8hJPRHN", "2017-08-03 14:05:49"], ["Flipboard share button - eye candy for flip-a-holics: \nhttps://t.co/VIFFzwIL5C", "2017-08-01 14:41:53"], ["Is the push for universal ID good or bad for publishers? Find out from our SVP of Publishers and Biz Ops @pclentz: https://t.co/8SctxpnVIu", "2017-07-31 14:50:03"], ["Tap into a gold mine of opportunity offered by WhatsApp: https://t.co/TedcCWeh1U", "2017-07-28 14:18:34"], ["Get to know \"visual search\" and why it matters for social media + SEO\nhttps://t.co/qKCdOmfxoo", "2017-07-27 14:02:58"], ["How do people in China, Russia, and Spain use social media?\nhttps://t.co/utQL9I8ynj", "2017-07-24 18:01:50"], ["Get a crash course on how to generate site traffic through Reddit: https://t.co/Z2YOw2czAt", "2017-07-19 14:16:27"], ["@ClearSlideHelp how can I restore deleted content?", "2017-07-19 01:57:31"], ["Try these top-notch Facebook tactics from BuzzFeed, Quartz, and The New York Times: https://t.co/08J56ktPor", "2017-07-05 15:43:29"], ["Here's how you can use Digg, StumbleUpon, and Xing to grow your readership.\nhttps://t.co/Y4TcR9wuhe", "2017-06-27 14:24:41"], ["Here's How You Can Generate Massive Traffic From Pinterest:   https://t.co/OhwM1Izm8b", "2017-06-21 17:38:41"], ["Trying to crack the code of real-time marketing? Break through with these lessons from sports marketers:  https://t.co/mWmzfHuOus", "2017-06-21 14:30:35"], ["Learn how ShareThis &amp; @Lotame helped @AMP_Agency reach in-market travelers driving a 455% Return on Ad Spend: https://t.co/9QgkqbzlR3", "2017-06-14 18:29:57"], ["Struggling To Gain Traction on Twitter? Try These 4 Strategies: https://t.co/b2VRCnvJrm", "2017-06-13 14:17:34"], ["Are you using these @LinkedIn strategies to drive traffic to your site? https://t.co/fMrUira4N3", "2017-06-09 14:58:07"], ["How publishers can leverage their first-party data to increase engagement and ad revenue: https://t.co/K6OKFWbdav", "2017-05-31 19:49:54"], ["What you need to know about the changes to Facebook’s algorithm and how it impacts your content:  https://t.co/Bsu3twCnRl", "2017-05-26 13:41:04"], ["How can you win the race for mobile readers? Here are five ways to set yourself on the right route: https://t.co/YEExjQYKWP", "2017-05-24 14:27:58"], ["How can you increase your social shares? First choose your share buttons.\nhttps://t.co/Y9PBeG8d1F", "2017-05-18 14:22:53"], ["A crash course on Social A/B testing for #data nerds: https://t.co/KWCiECdpPB", "2017-05-17 13:49:30"], ["Here's how to create effective intro copy to drive more traffic and engagement with your Facebook post: https://t.co/AjfvS6gCrT", "2017-05-16 13:45:55"], ["Our CEO @kurtabra shares how brands can make an impression on consumers by taking a page from summer blockbusters: https://t.co/nPUWaml4mt", "2017-05-15 16:03:08"], ["Social Shares Hit A Roadblock? Try WhatsApp Sharing\n https://t.co/s6Uqe5V6I3", "2017-05-15 14:26:41"], ["Can you use Facebook's algorithm to grow your audience? Yes — with these 4 strategies.  https://t.co/XXssq0AaLQ", "2017-05-11 14:40:26"], ["Do you know when and where to best reach Back to School shoppers? Find out from these insights. https://t.co/rQDFeb4Xsf", "2017-05-10 17:27:53"], ["It's not easy to come up with the perfect Facebook copy on your first try. That’s why we have A/B testing. https://t.co/fGUcewnb3l", "2017-05-08 14:12:47"], ["Ready to write headlines like the pros?  https://t.co/V1ZmmQnYkg", "2017-05-05 14:06:17"], ["Here's how you can build your own community of digital ambassadors by harnessing the power of social shares. https://t.co/IDSEHATTM7", "2017-05-04 19:39:35"], ["Shares are your greatest social currency. Get rich with these tips.   https://t.co/IDSEHATTM7 https://t.co/sh7Vgl3KsP", "2017-05-04 14:06:48"], ["We’re proud to win the Bronze @TheStevieAwards in the 2017 American Business Awards for our data solutions!  https://t.co/B6b1U2pT6j https://t.co/PEcjBNIpZI", "2017-05-03 17:37:25"], ["ShareThis Real-Time Online Data  + @Acxiom Offline Data = Better Marketing  https://t.co/UlZzBVz5Bl", "2017-05-03 14:22:56"], ["How can brands engage their audience in the age of social media? Check out this @Adweek article by our CEO @kurtabra https://t.co/Cqmblj5zIX https://t.co/CwzaIJ7Uvm", "2017-05-02 17:30:34"], ["Are you using these secret tips to engage your readers?  https://t.co/Y79E28enoD https://t.co/FwxhfmR9mt", "2017-04-28 13:58:06"], ["Our SVP of Global Data @andrewdumas had a great time meeting with global industry leaders at @icomglobal in beautiful Porto. https://t.co/rljJHb6wQ4", "2017-04-27 13:39:37"], ["Our CEO @kurtabra shares how we collaborate with LiveRamp to bring our unique real-time data to their marketplace:  https://t.co/5kZXWJO6GT https://t.co/kSIL6KNuNP", "2017-04-20 13:14:31"], ["Happy to announce ShareThis’ A/B testing is now available for all! See how it helped @USATODAY boost social traffic: https://t.co/KodV4MioM8", "2017-04-10 15:37:34"], ["How will you create your perfect share buttons? Check out 5 great examples of the new share buttons in the wild. https://t.co/fkLD7oARFT https://t.co/JUxKJk2NYV", "2017-04-04 15:08:28"], ["Where are the most passionate fans of #BeautyAndTheBeast in the world? @beourguest #SharingIntelligence https://t.co/46vTedyrv2", "2017-04-03 18:14:45"], ["Do you know that Mother’s Day and Father’s Day shoppers are content-obsessed? Find out more #SharingIntelligence https://t.co/ofspVfFeNZ https://t.co/BWm6vAKeDy", "2017-03-31 14:23:10"], ["How do you reach audiences right when they're ready to buy? With the power of real-time data. https://t.co/00NkMynWVP https://t.co/O16NTJ1xyr", "2017-03-30 15:43:21"], ["Here’s how @WSJ, @TheEconomist, and @tronc are boosting their revenue.  https://t.co/RCbpZ342ND https://t.co/SzI90WelD3", "2017-03-27 15:36:11"], ["Unsure which design to choose for your share buttons?  Find out the most trendy share button styles right now. https://t.co/QxmIrCuRm8 https://t.co/OT2xMEf9m1", "2017-03-24 14:10:06"], ["These are the most buzzed-about NCAA teams for Final Four. Are they in your #MarchMadness #bracket? #SharingIntelligence https://t.co/63lHYwC8Oz", "2017-03-23 14:00:23"], ["Losing fan engagement on Facebook? 5 tips to get your mojo back: https://t.co/CE5MSqRIeD https://t.co/DsMEYDzC7r", "2017-03-20 14:52:17"], ["We’re looking forward to #SXSW! Let’s connect if you’ll be there too! #sharethismoment https://t.co/JCCplpUz4e", "2017-03-09 20:21:49"], ["How one of the world's largest ticket sellers reached three unique audiences of fans at just the right time. https://t.co/dFPSpKpb7A https://t.co/VNwWvI5wn6", "2017-03-06 16:15:36"], ["Your archival content wants to party like it’s 2017—and with just a few changes, they’ll be the belle of the ball. https://t.co/fAR6SmHEmJ https://t.co/gyId6Vdfk7", "2017-03-01 15:01:23"], ["Who do you think is going to win #Oscars Best Actress? Our bet is on #Emma Stone based on our social sentiment analysis #SharingIntelligence https://t.co/wxVMF9MxCM", "2017-02-26 20:12:09"], ["Our new share buttons are mobile-first, just like your users. Turbo charge your mobile sharing today https://t.co/MRrT0V7YeS", "2017-02-24 17:52:42"], ["What makes an article shareable? Take these lessons from @BuzzFeed, @Medium, and @BusinessInsider --&gt;  https://t.co/N9r4DXlSzd https://t.co/wRHgnH3VQl", "2017-02-22 19:44:51"], ["Our SVP of Publisher Services shared advice on how brands can successfully champion a cause without blowback. https://t.co/NIMqMEYYnZ", "2017-02-17 21:58:12"], ["Happy #ValentinesDay! What do you think the social platforms of love are this Valentine’s Day? #SharingIntelligence https://t.co/vvTPlSgwyV", "2017-02-14 20:22:41"], ["Looking to up the effectiveness of your Facebook posts? We've got 3 surefire strategies for picking the right image: https://t.co/MROVHAKIqL https://t.co/cFCIQOk4ws", "2017-02-07 16:43:20"], ["5 ways to craft Facebook headlines that leave readers wanting more: https://t.co/p4PfjplLUU https://t.co/CTCf74d7s5", "2017-02-03 16:39:41"], ["What a year you've been, 2016. See the top trends and stats from the 2016 ShareThis' Year in Review  https://t.co/zVpUe3qxuC", "2017-01-30 16:10:00"], ["We're thrilled to announce the release of our newly designed share buttons to all of our publishers. https://t.co/UKLLDSQyCO", "2017-01-24 18:37:10"], ["No one writes the perfect Facebook copy on the first try. That’s why there’s A/B testing.   https://t.co/XTFDvolILZ", "2017-01-06 17:25:42"], ["Check out our CEO Kurt Abrahamson’s predictions on trends in real-time marketing in 2017 @kurtabra:  https://t.co/Zsm2uQiyO1", "2017-01-04 15:24:51"], ["Happy holidays everyone! We’re looking forward to a wonderful 2017 together! :) https://t.co/rBdJ6oJsBu", "2016-12-22 19:07:45"], ["We’re excited to partner with @EyeotaTweets to bring our Social Data Segments to the Eyeota Data Marketplace:  https://t.co/3tPFLb2RoN", "2016-12-21 20:08:00"], ["How @CNN is reinventing itself:  https://t.co/7mvXcENVKH", "2016-12-14 19:42:44"], ["It’s official: Humans now have shorter attention spans than goldfish. Earn their attention with these tips.  https://t.co/LNwfMJoGWR", "2016-12-05 15:04:56"], ["What brings warmth to the winter? Live music, cocktails, delicious food, and #thinktoys for children. Proud to be the reason a child smiles. https://t.co/UvXLvWwj2m", "2016-12-02 15:34:14"], ["Here’s how you can personalize the customer journey by using #martech and #bigdata.  https://t.co/sVqmgRUFfg", "2016-12-02 14:44:14"], ["Negative SEO hurts the search ranking of many sites. Find out how to protect your site from it https://t.co/2dCfVLpHcH", "2016-11-22 15:04:41"], ["Networking by day ☕ , beach by night🌴. And great learning in between😊. @DigidayEvents #DigidayDPRS  #programmatic https://t.co/KTsZ1yTX6m", "2016-11-16 15:34:47"], ["In the spirit of #halloween 👻🕷🎃🕸💀, here are five ways to treat your readers to earn their loyalty and trust: https://t.co/u7UCMT2hMK", "2016-10-31 17:59:49"], ["What you need to know about the changes behind Facebook’s algorithm and how it impacts publishers: https://t.co/4AKeCf2ubj https://t.co/k3hAxkKzkP", "2016-10-25 16:18:57"], ["Jargon disruption: A 'marketing buzzword jar' for thought leaders and innovators https://t.co/WWUcbqHzXG via @digiday", "2016-10-20 16:06:17"], ["If you think Black Friday and Cyber Monday shoppers are the same, you should check out #ShareThisInsights post: https://t.co/DuKYowqORA", "2016-10-18 21:27:26"], ["Start at minute 24 &amp; check out @ShareThis SVP, @andrewdumas, on the NYSE floor! https://t.co/MM6YlIDDXn https://t.co/ErD4Rmn3zw", "2016-04-18 20:25:19"], ["Exciting news as we partner w/ @facebook to announce headline testing for Instant Articles! https://t.co/gkW1XifBoW https://t.co/ThzrUoSmJW", "2016-04-14 17:28:55"], ["Ready to Rock! The latest blog post from our founder, Tim Schigel (@schigel) https://t.co/7V7sXvnQwA via @sharethis", "2016-04-01 19:41:37"], ["Our CEO, Kurt Abrahamson on #RampUp16's panel: The Next Generation of Data &amp; The Value of Real-Time. @kurtabra https://t.co/bgWn8wY5IX", "2016-02-23 23:16:11"], ["#Grammys2016 on now! Check out our infographic on Red Carpet sharing insights as you watch! https://t.co/mmq8yQayVP https://t.co/I8GZZ3txlo", "2016-02-16 02:51:01"], ["Check out the latest interview with our CEO @kurtabra as we look forward to participating in @LiveRamp's #RampUp16! https://t.co/9ePDU54zLT", "2016-02-11 18:55:49"], ["Nice to see social sharing finally influencing TV ratings! Thx for the article @emilysteel! https://t.co/owBSsgmHDq https://t.co/Eg65CwAKyh", "2016-01-22 00:39:08"], ["@ShareThis CMO, @EdHaslam shared his POV w/@ClickZ about @twitter's Conversational Ads https://t.co/rFM0Y6PaB5 https://t.co/BpyUfeiwRX", "2016-01-21 23:14:25"], ["Study: As Smartphone Use Increases, Are You Wasting Money on TV Ads? https://t.co/2e5XvFuKLo -- Thx @jlafferty21 for the insightful article!", "2016-01-20 18:19:39"], ["Read about The Second Generation of Sharing on @Adweek @SocialTimes, by @ShareThis  CMO, @EdHaslam https://t.co/q7CLnfPHfe", "2016-01-15 16:55:28"], ["This week we launched a new site and refreshed brand &amp; logo! Read more as to why here: https://t.co/vuXMRhaA9L #sharethisbrandrefresh", "2016-01-14 16:54:57"], ["Check out our new site &amp; refreshed branding! https://t.co/JHtuQR62P5 #sharethisbrandrefresh https://t.co/YJJbLKnEb0", "2016-01-12 15:45:20"], ["Check out our new site as we continue to focus on publisher success and connecting people through content they love! https://t.co/JHtuQR62P5", "2016-01-12 15:43:47"], ["#GoldenGlobes on now! Check out our infographic on Red Carpet sharing insights as you watch! https://t.co/mmq8yQayVP https://t.co/hMca4Ojvaz", "2016-01-11 01:49:21"], ["Check out our latest article written by our esteemed Data Scientist, Dr. Lakshmi Baskar: https://t.co/nL3pj4MMeV https://t.co/tfjp608zNu", "2015-12-14 19:11:47"], ["Check out our recent insights! @ShareThis will get you on the Red Carpet! https://t.co/mmq8yQayVP https://t.co/l87sU4hqQp", "2015-11-20 21:21:04"], ["Proud to be recognized by @inc5000 as one of America's Fastest Growing Private Companies! http://t.co/AvBMjkklp8 http://t.co/0zGbLotald", "2015-10-12 18:01:05"], ["Calling all Engineers! Come work at @ShareThis! We're hiring like crazy! https://t.co/bZBsRm8JTs | http://t.co/qF1944R2pI", "2015-10-07 17:41:41"], ["Turning the swimming pool of data into revelations that engage customers w/emotion! Nice @adexchanger article http://t.co/DdTNWw0j2m", "2015-10-07 04:20:54"], ["Out latest Engineering Blog Post on our experience at the Software Leadership Summit! http://t.co/XNPxiwxvpG", "2015-10-06 19:23:52"], ["Watch live right now! Our very own Jeremy Flynn presenting at Dreamforce. #DF15 #DomoDF15 https://t.co/7jpzGVPszf", "2015-09-15 23:51:23"], ["Gamers who share are more than 1.5X more likely to purchase what they share about! Find out more about #gamers here https://t.co/9CvKagHBDG", "2015-07-16 15:21:31"], ["Are All Gamers Created Equal? The new ShareThis Gaming Study will tell you! #Gamer https://t.co/Sqyjak1sPM", "2015-07-15 14:52:46"], ["Don't forget @ShareThis VP of Data, Insights is presenting at our Palo Alto HQ @NewCoFest #SiliconValley tomorrow! https://t.co/pdqVmQnpO4", "2015-06-08 21:11:43"], ["ShareThis Sales Exec Named @thinkLA Salesperson of the Year! https://t.co/FO3DBjGF5N", "2015-06-08 16:21:12"], ["Don't forget our VP of Data is presenting at our Palo Alto HQ during @NewCoFest http://t.co/4vNkX9GW1z", "2015-06-05 14:39:37"], ["Don't miss the Meteor South Bay meetup at @ShareThis Palo Alto HQ - next Wednesday, 6/10! https://t.co/11pv2lcEwo", "2015-06-04 14:05:22"], ["Don't miss our VP of Data and Insights speak at our Palo Alto Headquarters for @NewCoFest http://t.co/4vNkX9YwT7", "2015-06-02 15:50:45"], ["Don't forget to sign up for the @ShareThis session during @NewCoFest Silicon Valley on June 9th! http://t.co/4vNkX9GW1z", "2015-05-27 17:45:50"], ["Don't miss our VP of Engineering, Data and Insights speak at @NewCoFest Silicon Valley on June 9th http://t.co/4vNkX9GW1z", "2015-05-26 18:44:50"], ["Don't miss @ShareThis at this year's NewCo Silicon Valley in June! https://t.co/k3UoYfpgZ2", "2015-05-20 17:15:32"], ["We spoke at the @IEGroup Big Data Innovation summit on Real-Time Applications at Terabyte Scale https://t.co/70h8PFpcJj", "2015-05-20 13:45:49"], ["YOU are more important than you may realize! Check out this piece on digital influencers on @TheDrum https://t.co/KrB1Rb050g #ValueofAShare", "2015-05-14 15:57:19"], ["Our CTO wrote for @adexchanger about High Predictability Ad Serving. You need more than speed to beat competition! https://t.co/7PKMVgP95P", "2015-05-12 21:48:18"], ["How was your Mother's Day? Speaking of moms, Wired to Share: Online Social Behaviors of Moms\nhttps://t.co/QUGNQxzY11 http://t.co/SjLCFEjUAw", "2015-05-11 13:44:07"], ["Each month 46M viewers generate 150M+ social signals about TV. Check out our study today! http://t.co/AlJnO5DQAd http://t.co/csjGmbNM0w", "2015-05-08 16:55:47"], ["Our CEO @kurtabra presenting our latest TV Study at the @iab #NewFronts Check it out! https://t.co/tyHa1ILvXu http://t.co/lsAlrNhuxc", "2015-05-06 17:39:35"], ["46M viewers generate 150M+ social signals about TV - 11% of monthly social activity online! https://t.co/NQI6eyWBG7 http://t.co/rSaYMNEYhg", "2015-05-06 15:59:13"], ["Today our TV Study is live on the blog! 16% of viewers share about the shows they watch https://t.co/yeUjUgVdgb #socialmedia #tv #TVStudy", "2015-05-06 15:56:37"], ["The TV Study is coming... #socialmedia http://t.co/sb0KcJkZkr", "2015-05-06 13:21:26"], ["Happy #StarWarsDay #MayThe4thBeWithYou http://t.co/BZkhpPEfTn", "2015-05-04 19:40:37"], ["Thanks for sharing! https://t.co/aEgFTJGSDE", "2015-05-01 17:01:41"], ["Arts &amp; Entertainment was the most social category in Q1, driven by TV and video content #socialmedia https://t.co/pNIHenb07T", "2015-04-30 17:27:31"], ["Facebook continues to lead in sharing activity, 84% of shares from this quarter. Our Report: https://t.co/VhMm4wqeH3 http://t.co/0dqoET1OC5", "2015-04-30 16:31:05"], ["Facebook and smartphones took the lead in social sharing activity for Q1 #socialmedia https://t.co/yGDeUzsw5v", "2015-04-30 14:50:57"], ["Don't miss our VP of Engineering, Data and Insights speak at the @IEGroup Big Data Innovation Summit! Take control of your data!", "2015-04-28 21:05:18"], ["Thanks for including us! 70+ Best WordPress Plugins for 2015 http://t.co/KjtCnBoEG2 via @InspirePixels #socialmedia", "2015-04-17 14:43:29"], ["We're pumped to be nominated for @thinkLA Partner &amp; Sales Person of the Year! Vote here http://t.co/xcZAtSXr5Y http://t.co/BsYRkzsPJx", "2015-04-16 20:11:49"], ["We're pumped to be nominated for @thinkLA Partner &amp; Sales Person of the Year! Vote for Michael Kirschenbaum &amp; ST here http://t.co/xcZAtSFPHo", "2015-04-15 21:05:18"], ["How will social media signals play out in programmatic advertising? http://t.co/yiP5EHozhE", "2015-04-14 15:26:30"], ["Mad Men vs Game of Thrones: \"Mad Game of Sunday\" http://t.co/TxBr1hW9oK  via @ShareThis", "2015-04-13 20:19:37"], ["Congratulations to our VP of Data Science for making the @SVbizjournal Women of Influence List! http://t.co/pon3A1HZEm", "2015-04-10 15:50:16"], ["LiveRamp's @Justin_Schuster talked to us about the real value behind data-driven marketing http://t.co/Yvk7nn5pZt", "2015-04-08 14:51:04"], ["Join the ShareThis family! View our current exciting career openings http://t.co/Z9F7mSzE7Q #jobs #loveyourjob", "2015-04-06 15:25:42"], ["Check out the latest from the ShareThis engineering blog -- Monitoring Large Scale Data Pipelines http://t.co/IxdNE8Qlt0", "2015-04-01 19:25:16"], ["Pinners are up to 33% more likely to purchase what they pin than users on other social channels #socialmedia http://t.co/khDeeqYCFX", "2015-03-26 18:39:19"], ["Pintent to Purchase - how much is a pin on #Pinterest worth to your brand? http://t.co/3ZWPEnev5C", "2015-03-26 14:28:49"], ["Good morning Vail!  We're here at @DigidayEvents #DigidayDPS Say hit to @_nigel &amp; @pclentz", "2015-03-25 14:38:52"], ["This has been #trending on the ShareThis network for WEEKS!  Find out the #1 Song On Your Birthday http://t.co/J6go40tsd1 #socialmedia", "2015-03-25 14:30:31"], ["We're hiring in several departments, in offices across the country! Read more on how to join our awesome team! #job https://t.co/qOIBxTxBIc", "2015-03-10 15:14:14"], ["Check out the latest from the ShareThis Engineering Team! Asynchronous, high performance event logging http://t.co/Uxn3ewxfHj", "2015-03-09 18:44:56"], ["Will you be first in line to get the Apple Watch or Android Watch?", "2015-03-09 17:20:28"], ["Happy #NationalGrammarDay! http://t.co/OzmQj8xqgi", "2015-03-04 20:24:21"], ["#Sharing activity can be a key indicator of financial interest and intent, dependent on trends &amp; life stage http://t.co/wkhCR4ux43", "2015-03-03 18:55:13"], ["Social activity around #finance has been shown to preempt &amp; mirror market events &amp; spike at key times like #taxseason http://t.co/PC5u9PsLqe", "2015-03-03 18:12:09"], ["Happy #NationalPancakeDay Get a free shortstack at IHOP today!   http://t.co/foUD9iW1wO via @abcactionnews", "2015-03-03 16:40:17"], ["House of Cards fans :  Did you binge over the weekend? http://t.co/S398Rf6NSI via @ShareThis", "2015-03-02 17:52:22"], ["ShareThis co-founder calls for a revolution in engineering education http://t.co/CXmWOViHmk via @chicagotribune", "2015-03-02 17:01:13"], ["@Hockey_Sweater @ezralevant We can certainly help with that :)", "2015-03-02 16:49:17"], ["Live long and prosper", "2015-02-27 18:40:26"], ["Here's a summary of #TheDress opinions. Are your offices as engaged in this debate as ours? http://t.co/NS8QzfBGnL http://t.co/K10NDYycyE", "2015-02-27 15:56:52"], ["Do you see #blueandblack or #whiteandgold?? #TheDress has taken over the internet! Let us know what you think http://t.co/zSTrHFcl6T", "2015-02-27 14:51:51"], ["We're hiring in several departments, in offices across the country! Read more on how to join our awesome team! #job https://t.co/qOIBxTxBIc", "2015-02-25 21:43:04"], ["We're excited to be attending the industry's premier conference for data driven marketers tomorrow. Hope to see you there! #RampUp15", "2015-02-25 21:30:34"], ["@joseimprime We'd be happy to help you!  Please send an email to support [at] sharethis [dot] com and we'll provide instructions. Thanks!", "2015-02-24 22:26:48"], ["#Birdman stole the show last night! They nabbed a few of the coveted final awards including #BestPicture http://t.co/ubf4wvhI8l #2015Oscars", "2015-02-23 19:37:00"], ["Finally, the big award for #Oscars2015 goes to...#Birdman. Did you agree? If you could only share one nominated movie which one would it be?", "2015-02-23 05:05:08"], ["#JulianneMoore &amp; #EddieRedmayne took home the big awards! Who will win #BestPicture in the #2015Oscars?", "2015-02-23 05:00:34"], ["It's down to the final few awards of the #Oscars2015! Who do you think will take home #BestActor #BestActress &amp; #BestPicture?", "2015-02-23 04:21:49"], ["Last year social exploded during the #Oscars but activity had been building momentum since mid-January! #socialmedia  http://t.co/f2d0w9loOc", "2015-02-23 02:39:15"], ["Bradley Cooper is nominated a 3rd year in a row from 2013! Here’s a look at all the awards from that year http://t.co/0h1jblLBtq", "2015-02-23 02:08:51"], ["What an amazing opening performance, #NPH is such a great performer. What were your favorite movies this year? #Oscars2015", "2015-02-23 01:39:39"], ["We're watching the #Oscars red carpet! Who do you think is taking home the awards? We made our predictions here http://t.co/9f14DU3aWs", "2015-02-23 00:10:18"], ["One year ago today we released our #Hispanic Study &amp; found that hispanics are more #social &amp; more influential! #fbf http://t.co/Wxo0Ftn5JJ", "2015-02-20 17:16:43"], ["Our VP of Data Science presented at @IEGroup Data Science Innovation Summit on the science of messaging and #bigdata http://t.co/tlBYqu5ZNM", "2015-02-20 17:06:06"], ["#tbt to our latest Consumer Sharing Trends Report from Q4 2014. Mobile sharing continues to grow! http://t.co/BZVSHM6MHI", "2015-02-19 20:36:58"], ["New York Fashion Week is rounding out, see what chic articles from @THR @voguemagazine were trending last week! http://t.co/sHpNRes77Y", "2015-02-19 17:21:07"], ["And the Oscar Goes to…For the #AcademyAwards social predicts Bradley Cooper, Reese Witherspoon and American Sniper http://t.co/olvjiAwxYA", "2015-02-18 18:29:46"], ["It's nearly 2 months into 2015 - how are your resolutions going? Here are some tips to meet #fitness resolutions! http://t.co/mDz3LKHYfB", "2015-02-17 17:16:46"], ["How did you spend your Valentine's Day weekend? Did you #ShareTheLove? http://t.co/U2lT05styd", "2015-02-17 16:08:48"], ["@mindvalley we love your idea to have a Love Week! Why celebrate only one day? #SpreadLoveWeek http://t.co/be5Kt6VNcd", "2015-02-13 20:30:32"], ["11 Ways to Say 'I Love You' with Food on Valentine's Day\nhttp://t.co/5UuZpFEysY via @RachaelRayShow", "2015-02-13 16:15:36"], ["Valentine's Day is tomorrow!  How are you going to share the love? #ShareTheLove", "2015-02-13 16:12:42"], ["It's been a whirlwind week with nightly anchors #JonStewart #BrianWilliams and #BobSimon #TrendingThursday http://t.co/lox8YSktil", "2015-02-12 21:35:50"], ["We're BIG on innovating. Join our Rocketship! http://t.co/A5M894rrxC http://t.co/QW64NgUx8z", "2015-02-12 21:34:30"], ["@annie_amountain Now that's a lot of sharing! :)", "2015-02-12 16:01:27"], ["RT @jmgrp: Use this Widget on your website to make it easy for users to share content. #SEO #socialmediamarketing http://t.co/wXr9KHNmra", "2015-02-12 15:56:14"], ["Rats, we didn't win the Powerball. How much would you have shared if you won a cool $500 mil?", "2015-02-12 15:51:19"], ["Hey @schigel Happy Get Out Your Guitar Day! http://t.co/ltYeenAkqw", "2015-02-11 18:41:54"], ["Check out the latest from the Engineering team at ShareThis! #Docker http://t.co/QxxKeE82Kf", "2015-02-11 15:13:31"], ["We're presenting @Cynopsis Boot Camp tomorrow with @m80social ! Stay tuned for the latest in social from @ShareThis http://t.co/j3ALPlkc4M", "2015-02-09 17:15:10"], ["The Patriots didn't only win the #SuperBowl but the Social Bowl as well! #socialmedia http://t.co/VHDsOaBG5L", "2015-02-06 19:33:47"], ["Happy birthday to you! Happy birthday to you! Happy 10th birthday @facebook Happy birthday to you!  #FriendsDay", "2015-02-04 20:08:59"], ["Social called the #PatriotsWIN early on #SuperBowl2015 http://t.co/fOkdDIrgSp", "2015-02-02 20:25:14"], ["Women in Business Q&amp;A: Yan Qu, VP of Data Science, ShareThis http://t.co/Fc1d9q8NQ0 via @HuffPostBiz", "2015-02-02 18:52:01"], ["Download the new @Location3 #ebook today: \"Connecting Online &amp; In-Store Marketing Strategies\": http://t.co/XqgxSxNu6o #digitalmarketing", "2015-02-02 16:30:01"], ["What did you think about the halftime entertainment? #Superbowl2015 #socialmedia", "2015-02-02 01:56:46"], ["Think social predicts? Patriots Take an Early Win on Social\nhttp://t.co/IwRbIrkC8P", "2015-02-01 23:15:01"], ["Who's going to win the Super Bowl? Who's going to win the puppy bowl? Who's going to win best actor? Oops wrong night!", "2015-02-01 23:12:29"], ["For Democrats, #climatechange and #NetNeutrality are top priorities looking to 2016 http://t.co/UbB5rR4u7N http://t.co/N6CPiQu2WT", "2015-01-29 20:08:29"], ["Check out why ShareThis chose #Cassandra for #bigdata http://t.co/zWTUcFQDDX", "2015-01-28 22:55:09"], ["Patriots Take an Early Win on Social\nhttp://t.co/IwRbIrkC8P http://t.co/uRn6NAVDIv", "2015-01-28 20:16:04"], ["Facebook and Instagram are back up! Now get back to sharing!", "2015-01-27 07:13:13"], ["Check out our job listings! We fully support sharing (there are over 100 other channels).", "2015-01-27 07:00:07"], ["According to our data, users are currently sharing more on Twitter than on Facebook and Instagram. ;)", "2015-01-27 06:45:21"], ["It's #TieThursday at ShareThis! Does your office have any weekly traditions? http://t.co/WWHeCpkBmo", "2015-01-22 15:52:53"], ["We released our Q4 2014 Consumer Sharing Trends Report - see how mobile beat desktop in 2014 #SocialMedia #Mobile http://t.co/LIljYBwQYV", "2015-01-21 15:22:31"], ["LOVE @jenakingsley's latest video! Social Networking in Real Life -SOCIAL EXPERIMENT- Prank https://t.co/TOfni4xa7p", "2015-01-20 16:39:40"], ["A Real-Time look at Richard Sherman [2014]: Respect is Low, Shares are High http://t.co/zjHkZmXpMg via @ShareThis", "2015-01-19 01:33:13"], ["Our #2014 Moments Infographic is up on the blog! Get the recap on FB and read more here: http://t.co/NJpvI3ssfE #sharing", "2015-01-16 17:50:29"], ["Read all about our VP of Data Science, Yan Qu, and how she got to where she is today! @lauraemilyd http://t.co/CeDb8lT1xL", "2015-01-16 17:30:39"], ["Interview with @wtknapp gives a preview into the new @sovrnholdings dashboard, Meridian #digitalpublishers http://t.co/eSC512xEWv", "2015-01-13 16:03:20"], ["Leveraging New Cycles to Engage Audiences on Fitness Goals http://t.co/wCIZDXwaq7 #2015resolutions #socialmedia", "2015-01-07 18:31:08"], ["Travel Planners Migrate to Mobile - @eMarketer http://t.co/QruRlblONY", "2014-12-19 14:16:01"], ["Will 2015 be the year we make social data personal? We think so!  http://t.co/JCXRl1uhxo", "2014-12-18 22:23:26"], ["We chatted with @5byrocks about the secret sauce behind their awesome app! http://t.co/3CSYoLMnEZ", "2014-12-18 22:04:11"], ["Our Principal Engineer in @InformationWeek Why We Picked Cassandra For Big Data http://t.co/G6X2dWkce4", "2014-12-18 17:11:52"], ["What's on the horizon for 2015? Think #Viewability #programmatic and #socialdata http://t.co/CPLUKXEcuF", "2014-12-18 15:41:53"], ["We took a look at #darksocial , what's going on behind emails and copy and paste? http://t.co/RskbzxE75S", "2014-12-16 19:03:46"], ["Taylor Swift stole the Victoria’s Secret Fashion Show on social media last night http://t.co/QgoKnN91t7 #VictoriaSecretfashionshow2014", "2014-12-10 20:13:46"], ["How did @ForTheWin become the fastest growing online sports property? #SocialMedia and a viral content strategy http://t.co/5AxUDYA6W6", "2014-12-08 20:50:12"], ["@augieray @Nielsen Hi! You can actually easily customize the \"via @\" settings in WordPress. Happy to help if you have any questions, thanks!", "2014-12-08 19:51:26"], ["Thanks for the shout out! @HuffPostBlog Speed to Market is Essential for Success in the Digital Age http://t.co/P05K2GS7pu", "2014-12-08 15:42:47"], ["Rumored Datalogix Acquisition? Makes a lot of sense to us.. http://t.co/xYyi2L0w8o", "2014-12-05 21:01:40"], ["How did For The Win increase site their traffic by 24%? Easy user engagement and a viral #socialmedia strategy http://t.co/XputHAeJMQ", "2014-12-05 18:21:30"], ["How did @ForTheWin become the fastest growing online sports property? #SocialMedia and a viral content strategy http://t.co/5AxUDYA6W6", "2014-12-04 20:48:57"], ["Thanks fellas. Join me next time for our Q&amp;A on knit hats and next-level brunch recipes. Upward &amp; onward! @Pillet_Mignon out.", "2014-12-04 20:35:53"], ["@Jciv17 on point as always, brhododendron! Definitely. Ramps up throughout the year and peaks during breaks. #summervibes #STtravelmarketing", "2014-12-04 20:32:09"], ["@Jciv17 solid Q, broheim! Facebook tends to dominate sharing, but planners lean more on Tumblr and Blogger #blogs4lyfe #STtravelmarketing", "2014-12-04 20:25:36"], ["@Jennabrown23 People are more likely to plan out their trips on a desktop (keyboard required), but share pics on mobile #STtravelmarketing", "2014-12-04 20:20:36"], ["@Missypoo586 And it turns out, travel planners are TWICE as social #whaaat #STtravelmarketing", "2014-12-04 20:11:08"], ["@NicoleKapner It contributes to perspective, fulfillment and personal identity. Who wouldn't share about travel? #STtravelmarketing", "2014-12-04 20:10:00"], ["@Missypoo586 Travel planners are users who actively searched travel planning keywords more than 3xs w/n a 1 week period. #STtravelmarketing", "2014-12-04 20:08:30"], ["Viv here taking over the ShareThis Twitter account for the next half hour.  Travel Study Questions? Fire Away #STtravelmarketing", "2014-12-04 20:07:01"], ["Potential @Datalogixinc Acquisition? We think it makes a lot of sense http://t.co/FDW51yd279", "2014-12-04 18:11:07"], ["Is it #CyberMonday this year, or have we moved on to Cyber December? Either way, it's taking place on mobile http://t.co/rPmCvfKxyy", "2014-12-04 18:04:05"], ["Don't forget! Today at 3pm EST @Pillet_Mignon Twitter Takeover about our Travel Study http://t.co/Xhs3t1Tv4f Questions w/ #STtravelmarketing", "2014-12-04 17:05:53"], ["Capitalize on the mobile trend. Introducing the first release of our Mobile Widget! http://t.co/jopKbTk27b #mobile", "2014-12-04 14:59:16"], ["Questions about our Travel Study? http://t.co/fS8kzBIIKj @Pillet_Mignon Twitter Takeover tomorrow 3pm EST! Questions w/ #STtravelmarketing", "2014-12-03 19:51:26"], ["Online travel shares are engaged with 40% more than other types of content #SocialMedia #TravelMarketing http://t.co/iqyDr3Y0J4", "2014-12-03 19:39:58"], ["35% of all travel sharing comes from #Millennials compared to only 22% of general sharing #TravelMarketing http://t.co/iqyDr3Y0J4", "2014-12-02 15:08:51"], ["Have a GREAT weekend everyone!  TGIF! #sharethismoment http://t.co/efaLEKT9IR", "2014-11-21 17:21:03"], ["This #TechTuesday, Learn How to Transform Big Data into Smart Data with Dr. Yan of @ShareThis @women2 http://t.co/XTOpFwHnQG", "2014-11-18 18:32:20"], ["We are excited to announce that Wade Rifkin is the new VP, Programmatic Partnerships @ShareThis #programmatic http://t.co/OwdDpLMylM", "2014-11-18 17:53:11"], ["Who Really Broke the Internet? Was it #KimKardashian ? Or was it #Rosetta and #Philae ? http://t.co/Ov2TaFbe3q", "2014-11-17 18:48:10"], ["Check out the latest from the ShareThis tech blog! Multi-KPI optimization for campaigns with our #RTB platform http://t.co/etZHmNYCIe", "2014-11-10 19:35:29"], ["Our new research around the #Midterms2014 post election day found that sharing is predictive of election outcomes http://t.co/FsRotB12PI", "2014-11-07 20:58:46"], ["We added @Flipboard as one of our 120+ social sharing channels! #socialsharing http://t.co/40OeV3kzPW", "2014-11-06 17:54:59"], ["Tell us about your rise to fame #AndyFromShareThis http://t.co/OPL0bHTYz0", "2014-11-05 16:48:40"], ["Just in time for tomorrow's #Election2014 the @ShareThis politics research is highlighted in @PBSMediaShift  http://t.co/sfJruIICAt", "2014-11-03 15:46:37"], ["Sharing behavior around financial conversations finds social engagement mirrors market volatility http://t.co/1IaSiYC4IP", "2014-10-30 17:11:15"], ["Gearing up for #midtermelections Republicans are active on #Facebook and Democrats are taking to #Twitter and #Reddit http://t.co/rJJtK1EbPU", "2014-10-28 14:37:04"], ["Check out #trendingcontent this week with #HarryPotter surprises, #EbolaInNYC and #PeytonManning http://t.co/zE9OtJLn3l", "2014-10-24 18:27:26"], ["Consumers online are 5X more engaged within 24 hours of an event -- a key factor in RTM strategies #RTM http://t.co/nTuqogm9sn", "2014-10-23 14:31:27"], ["With the intersection of content and technology we are seeing more brands becoming publishers #contentmarketing http://t.co/21kyQZkKpz", "2014-10-22 19:09:09"], ["How does @StumbleUpon integrate #nativeadvertising into their discovery tool? @Tealn tells all on consumer experience http://t.co/YLU6HVxV98", "2014-10-22 14:43:43"], ["Younger audiences are the most socially active - ages 18-25 share 2.1X more immediately following events #millennials http://t.co/nTuqogm9sn", "2014-10-20 15:55:51"], ["H20 Workshop for @ShareThis Data Science Team - check out what we learned about the in-memory open source platform! http://t.co/9Gx401NNNs", "2014-10-15 19:59:18"], ["Major events cause swings in channel usage - #Twitter quickly jumps 3X immediately after an event http://t.co/FeXOW4QdFs", "2014-10-14 19:28:21"], ["Tablets took the stage as the true second screen with a 2X spike in sharing during #sharkweek and #NFL openers http://t.co/FeXOW4QdFs", "2014-10-14 17:16:03"], ["Consumers online are 5X more engaged within 24 hours of an event -- a key factor in RTM strategies #RTM http://t.co/FeXOW4QdFs", "2014-10-14 14:34:12"], ["Trending content in the @ShareThis network with details on the new #Tesla, #MeghanTrainor and more! #TGIF http://t.co/B6kZ8rySAm", "2014-10-10 18:36:32"], ["Check out how @QuickeeCam used the ShareThis Web Share API to enhance their social sharing! http://t.co/ynmEQ9Abyh", "2014-10-09 18:16:31"], ["THANKS! \"What’s in a share? How social media fuels the festival culture\" http://t.co/yUel9T67DQ via @dancingastro #socialmedia #festivals", "2014-10-08 13:47:55"], ["Top Shares this week with #GoneGirl, #ISIS and the #oregonvsarizona Game -- find out what's trending! #TGIF http://t.co/TviGxsLdtN", "2014-10-03 16:27:13"], ["We know his fans will miss him like crazy, but how did social say good-bye to baseball legend #DerekJeter ?http://t.co/hy0U9nyjsu", "2014-10-02 18:24:42"], ["ShareThis' VP, Consumer Products, @sshadmand presented for NewCo's Yahoo Content Series -- check out how it went! http://t.co/3vh6dsgTMY", "2014-10-01 15:53:21"], ["Be strategic with your data -- use it smartly and let it enhance your processes and cross-device platform #bigdata http://t.co/zJkRfOv60Z", "2014-09-30 22:30:19"], ["CEO of Lotame, @andymonfried discusses how to stay ahead of the curve in today's evolving technology landscape http://t.co/zJkRfOv60Z", "2014-09-30 18:16:22"], ["#AWXI #WiredCMOs \"if you had one magic wish for your industry what would it be?\" Great answers - less fear, fraud, myth busting &amp; trust", "2014-09-30 16:50:13"], ["#AWXI #WiredCMOs \"we spend time looking at social sentiment - the ability to interact with the community in product development\"", "2014-09-30 16:45:24"], ["#AWXI #WiredCMOs ? &amp; answer time! \"How are you leveraging what people are saying about you and channeling that to increase brand awareness?\"", "2014-09-30 16:43:45"], ["#AWXI #WiredCMOs \"once you can use data and see the effectiveness of that data - that's the goal, &amp; programmatic will be used more and more\"", "2014-09-30 16:41:50"], ["#AWXI #WiredCMOs the first step in having consistency in the brand is making sure each person in the company understands what our goal is", "2014-09-30 16:35:31"], ["#AWXI #WiredCMOs \"keeping your employees supported and inspired is so important\"", "2014-09-30 16:32:50"], ["#AWXI #WiredCMOs technology and creativity are supporting one another. tech makes it possible to deliver creativity at the right moment", "2014-09-30 16:28:47"], ["#AWXI #WiredCMOs \"programmatic sometimes gets looked at as this cheeky thing...but it's pure necessity.\"", "2014-09-30 16:27:44"], ["#AWXI #WiredCMOs \"It's about retention, how do you continue to retain? A new generation of talent coming in is a driving factor in change.\"", "2014-09-30 16:23:14"], ["#AWXI #WiredCMOs \"how do you make data actionable?...Are you able to ingest the information quickly to make informed decisions\"", "2014-09-30 16:21:42"], ["#AWXI #WiredCMOs \"there's going to be a lot of failures, that will force the change\" #trialanderror", "2014-09-30 16:18:32"], ["#AWXI #WiredCMOs \"for awhile the biggest job of a CMO was to spend money wisely\"", "2014-09-30 16:16:04"], ["#AWXI #WiredCMOs \"trust is one of the most important words to describe the age that we're in...agencies have to be more open that ever\"", "2014-09-30 16:14:12"], ["#AWXI #WiredCMOs \"the walls between the skill sets in the organization are coming down\" @wolfrom", "2014-09-30 16:11:30"], ["We're live tweeting the #AWXI #WiredCMOs panel!", "2014-09-30 16:11:12"], ["The @WIRED CMOs panel is in 10 min @NASDAQ marketplace! Come see @wolfrom speak with other great marketing folks", "2014-09-30 15:50:26"], ["If you are attending @advertisingweek please join us at noon for @WIRED CMO's with @wolfrom Come say hi!\nhttp://t.co/hyTR2sTChr #AWXI", "2014-09-30 15:04:47"], ["What's the best way for brands to drive consumer engagement? Taking control of their own #bigdata http://t.co/p80B9jIbAv", "2014-09-30 15:02:30"], ["#AWXI is off to a great start! We'll be out and about so don't be shy! @advertisingweek", "2014-09-29 14:39:28"], ["Please join @ShareThis and our VP of Marketing, @wolfrom on the fabulous @wired CMO panel on 9/30 #AWXI", "2014-09-29 13:42:00"], ["@Ginjjah lol, exactly - love that movie ;)", "2014-09-26 19:25:19"], ["Join Our Rocketship! Interested in working with insanely awesome, fun and brilliant folks? http://t.co/9MMT8R9ggg http://t.co/dm1DfLbyHR", "2014-09-26 18:57:16"], ["Attending @advertisingweek?  Stop by the @WIRED CMO's panel with @wolfrom http:// http://t.co/tg7xorSRXH #AWXI", "2014-09-26 18:07:52"], ["#TopShares are up and we've got scandals! From the #NFL to #HowToGetAwayWithMurder and #GoneGirl http://t.co/nT2vQdPHlb", "2014-09-25 19:47:41"], ["Do you know how to say the word \"share\" in a different language? Let us know!", "2014-09-25 16:05:46"], ["We're at @online_news #ONA14 in #Chicago! If you're there keep an eye out for us http://t.co/uSnGvl3ZVw", "2014-09-25 15:43:16"], ["Our new Consumer Study on #millennials in @ClickZ -- Millennials More Likely to Purchase What They Share on Social http://t.co/Fvp1W8eMZ5", "2014-09-24 18:53:01"], ["Check us out in @marketingcharts What and When Millennials Share on Social Media http://t.co/nJeJoRMIeb", "2014-09-24 17:14:31"], ["#Millennials have taken to #mobile and multiple screens in stride -- their social web extends beyond just desktop http://t.co/Kmg1ehwc1r", "2014-09-23 20:35:31"], ["More passionate on social media than other age groups, #millennials are 2.3X more likely to click on shared content http://t.co/Kmg1ehwc1r", "2014-09-23 17:41:26"], ["Congrats!  RT @Missypoo586  My four year anniversary at @ShareThis celebrated in our brand new office on Fifth Ave. https://t.co/H24rpfLOB8", "2014-09-23 15:00:03"], ["#Millennials are 3.6X more likely to share product reviews -- turning to #socialmedia for purchase decisions http://t.co/s3JO7wdKhN", "2014-09-23 14:56:48"], ["Check out the latest from the ShareThis blog -- Compression &amp; Data Format for Log File Storage http://t.co/oVcJQl93OF", "2014-09-22 19:31:59"], ["What does everyone think about the #iOS8 update?", "2014-09-19 15:33:41"], ["Follow us on Instagram @ShareThis for pics from our offices cross country. We like #tbt's, cute dogs &amp; sharing! http://t.co/qlqFMvEnET", "2014-09-18 16:21:16"], ["What's trending on the internet this week? #AdrianPeterson #SadieRobertson #NFL http://t.co/2Xg3kGXvh9", "2014-09-17 17:59:42"], ["Not ready for summer to end? Get your last music festival fix with our infographic on #Lollapalooza #Coachella #EDC http://t.co/MBPl7xCugp", "2014-09-16 20:18:09"], ["The #H2O open source in-memory prediction engine is making life easier for the @ShareThis Data Scientists! http://t.co/Ob5TFB8SWR", "2014-09-16 15:42:36"], ["Our Summer Music Festival infographic has surprising insights on @lollapalooza @coachella @Bonnaroo #EDC and more! http://t.co/7LRUdw4QgX", "2014-09-15 14:30:26"], ["Apple’s Week in Review -- How did the #AppleWatch and new #iPhone6 trend on social? http://t.co/bBSVlACb7Z", "2014-09-12 18:44:51"], ["#NeverForget. We're proud to be neighbors with these brave men. http://t.co/onATrnpUoi", "2014-09-11 15:05:59"], ["Don't miss our VP, Consumer Products @sshadmand present @NewCoFest on Friday! #NewCoSF http://t.co/13HNqNlvdv", "2014-09-09 19:19:50"], ["Wearable technology encourages healthy lifestyles, will we see wearables at the #AppleEvent tomorrow? #wearabletech http://t.co/p0av4HWGU3", "2014-09-08 20:41:02"], ["How can brands measure ad effectiveness? Stick to the three R's: reach, resonance, reaction http://t.co/15RH3YCp2n", "2014-09-04 14:53:24"], ["How can brands measure ad effectiveness? Stick to the three R's: reach, resonance, reaction http://t.co/15RH3YCp2n", "2014-09-03 18:33:07"], ["What's going to shape marketing of the future? @beardrs tells us to pay attention to #data #realtime and #technology http://t.co/15RH3YCp2n", "2014-09-03 14:19:26"], ["Don't miss our VP, Consumer Products @sshadmand present @NewCoFest next week! #NewCoSF http://t.co/13HNqNlvdv", "2014-09-02 17:19:55"], ["Imagine All the People…Sharing For Today, but how are we making this big data actionable? #BigData #Mobile http://t.co/gz13fpSst6", "2014-09-02 16:30:37"], ["What an awesome video! @somekindawonder\nhttp://t.co/8COM5ISVJL", "2014-08-27 19:13:52"], ["The #napaquake caused major spikes in social sharing, #Facebook was the network with the highest jump. http://t.co/aIAQtzOuWT", "2014-08-27 18:50:04"], ["We are participating in the #NewCoSF Festival, and are excited to be presenting among so many innovative companies!  http://t.co/fLSyC39bDQ", "2014-08-26 20:27:53"], ["Top shares this week all about the best dressed celebs, major awards and Robin Williams tribute at the #Emmys2014  http://t.co/rhVV5VIGrl", "2014-08-26 18:05:48"], ["ShareThis VP of Data Science, Dr. Yan, tells us how to make social sharing data actionable! https://t.co/Li3H1jFflr", "2014-08-26 14:20:48"], ["Liven up your Monday with the latest blog from @ShareThis on how to make product development process more efficient! http://t.co/8FnkKq7vyq", "2014-08-25 18:24:49"], ["Have you voted? Check out the best mascots up for the @advertisingweek Walk of Fame! #AWXI http://t.co/EO9apCQhpn http://t.co/YZDAKELW2Q", "2014-08-25 15:36:44"], ["What was your favorite music festival this summer?", "2014-08-22 16:59:53"], ["Can the new cat video actually have a true impact on ALS? We hope so. New blog post about the #IceBucketChallenge http://t.co/yte96BbTkA", "2014-08-14 15:42:48"], ["The women of ShareThis attended the Meet, Mingle and Mentor social for women in tech at Box Inc! http://t.co/jlE1eqYfuK #womenintech", "2014-08-14 14:41:48"], ["Latest from the @ShareThis Tech Blog! Vendor Evaluation of Content Analysis Systems http://t.co/PIQnxs0vuM", "2014-08-13 16:44:38"], ["Top Shares this week pays tribute to the recent passing of Robin Williams, the legendary actor and comedian http://t.co/bpbHdsSjd9", "2014-08-12 17:53:38"], ["The @ShareThis Q2 consumer sharing trends report tells you what you need to know about #mobile marketing http://t.co/QGV1l7aLYv", "2014-08-11 19:45:21"], ["This week's top shares are up! #TeenageMutantNinjaTurtles premiere, #DanLeBatard and more! http://t.co/LPqmtJV1ge", "2014-08-08 19:04:47"], ["ShareThis’ Dr. Yan Qu was Named one of Fortune’s 2014 Big Data All-Stars! #bigdata #innovation http://t.co/WMBd08kbie", "2014-08-06 17:42:05"], ["Congrats to our own Dr. Yan!  Meet Fortune's 2014 Big Data All-Stars http://t.co/cN1ZUwZkB5 via @sharethis #socialmedia #bigdata", "2014-08-05 14:17:06"], ["Top shares this week are up with #mistycopeland, #DanielRadcliffe and #EbolaOutbreak #TrendingNow #TGIF http://t.co/b5wmiwet4T", "2014-08-01 13:47:35"], ["Latest from the @ShareThis blog - MySQL Performance Tips For Large Scale Datasets http://t.co/755mTiF89l #MySQL #Datasets", "2014-07-28 15:34:42"], ["Mobile Sharing, Engagement Continue to Rise on Social Platforms @skyword http://t.co/DJUW4JO8PK", "2014-07-24 19:38:23"], ["The NYC ShareThis team never flakes on a bet. Congrats LA Kings! #sharethismoment http://t.co/qZ8y7uMlDa", "2014-07-23 19:21:33"], ["Pinterest Ramps Up E-Commerce Features #pinterest @ClickZ @chenilleyuyu http://t.co/Xf2RXW7U5D", "2014-07-22 13:35:02"], ["Pinning? Bet You're Doing It on Mobile @eMarketer #pinterest http://t.co/NyTxZgrHhM", "2014-07-22 13:17:00"], ["Check out the latest from the @ShareThis blog! Lightweight Remote Execution Framework for Ops Automation http://t.co/TKHS3l5tfN", "2014-07-21 15:40:34"], ["Top Shares this week are up! Trending content on #Ukraine, #MH17 #KacyCatanzaro and more! #TGIF http://t.co/iH2YUkEZN6", "2014-07-18 16:58:51"], ["Are you enjoying your National Agency Appreciation Day sweets &amp; treats? Send us pictures with #ShareThisMoment", "2014-07-17 20:45:06"], ["Balaji Gopinath talks to us about harnessing technology to drive innovation across the media industry #innovation http://t.co/AM7m6zXHSG", "2014-07-16 18:16:35"], ["July's Shared Conversations with Balaji Gopinath on his work at @themediacamp the first media focused accelerator!  http://t.co/5ftQaJpocd", "2014-07-16 15:10:22"], ["We partnered up with @attdeveloper to bring you the AT&amp;T Text Button! Mobile sharing is now easier than ever #Mobile http://t.co/aJHFwBZAip", "2014-07-15 16:26:12"], ["This Thursday is National Agency Appreciation Day &amp; we have a ton of gifts shipping out! Can you connect the dots?https://t.co/OattR9uOoh", "2014-07-15 15:30:44"], ["Although #Facebook owns 60% of shares, #Pinterest &amp; #Twitter continue to grow, gaining on Facebook territory http://t.co/eN3SRI6StA", "2014-07-11 17:24:32"], ["“Think You Know All About Mobile Marketing? Think Again.” by @kurtabra https://t.co/0GbmHzHPGM", "2014-07-10 17:28:46"], ["43% of social activity on tablets was driven by users 55+, compared to 21% on smartphones and 34% on desktop http://t.co/eN3SRI6StA", "2014-07-09 21:01:43"], ["Check out our report in @WebProNews Which Content Is Being Shared More On Which Networks http://t.co/muvmQ6sNAr", "2014-07-09 16:28:12"], ["75% of all #Pinterest and #Twitter sharing is #mobile, compared to 50% of #Facebook sharing http://t.co/eN3SRI6StA", "2014-07-09 15:33:00"], ["Despite representing only about 30% of overall browsing activity, #mobile devices drive 50% of social sharing http://t.co/eN3SRI6StA", "2014-07-09 14:04:41"], ["In this weeks #topshares the CIA joins #twitter, #Neymar is out of the #WorldCup and fashion hits the beach http://t.co/gOxrzVThvC", "2014-07-08 19:10:21"], ["Don't miss our VP @sshadmand at #MobileBeat in SF today discussing how we can stay connected in a device heavy world!", "2014-07-08 17:54:19"], ["Check out top shares this week before heading out of the town for the #4thofJuly holiday weekend! http://t.co/fMCeAQF9Ly", "2014-07-03 17:17:06"], ["Like it or Not, That Article You Shared May Inspire Your Friends to Buy. Read more on @pclentz's @mint blog post https://t.co/7mcXydP7ub", "2014-07-01 19:51:56"], ["It's #MusicMonday! What jams are you sharing right now? We're still loving Pharrell's \"Happy\" #ShareThisMoment http://t.co/tcbiNDRLRA", "2014-06-30 20:32:45"], ["Thank you @Postmates &amp; @blueribbonfc for making @theJFly 's last lunch in our NYC office yummy! http://t.co/RTgHznyrHF", "2014-06-27 16:43:33"], ["Happy Birthday to our very own CRO Jon Gregg! Hope you have a great day from @ShareThis #ShareThisMoment", "2014-06-27 14:49:16"], ["Go #USA ! @ShareThis does the #WorldCup2014 #sharethismoment http://t.co/AYKHI4kLpK", "2014-06-26 18:20:18"], ["This Q1 report on consumer trends puts #twitter in the spotlight with help from #mobile sharing http://t.co/MehBFsstW2", "2014-06-26 15:31:07"], ["Top Shares this week are up! We've got trending content on the #WorldCup #DianeSawyer and the #economy http://t.co/9TZWI8mzrI", "2014-06-25 16:44:36"], ["What's up with CPG marketing this season? We'll tell you where and how to activate on your social audience! #CPG http://t.co/0Odvq4d1U3", "2014-06-25 15:31:29"], ["Thank you @iablta and @CGlush  for the invite at #IABFLYIN in Washington DC! #sharethismoment http://t.co/KoIBlSqkQq", "2014-06-24 16:47:47"], ["Latest from the @ShareThis Blog! OAuth2.0 in ShareThis AdPlatform for authentication and authorization http://t.co/Y6z1VxYZfX", "2014-06-24 16:35:14"], ["How can brands reach their hispanic consumers? Don't ignore #mobile and understand their social influence! http://t.co/iqa3faEjg7", "2014-06-24 15:31:02"], ["You're welcome! We're excited to be here with awesome industry experts! RT @iablta:Thank you @ShareThis for the actionable advice! #IABFLYIN", "2014-06-23 20:03:57"], ["We're at the 6th annual #IABFlyIn today in DC! Say hi to Justin and Jenna!", "2014-06-23 17:42:26"], ["What did you all think of last night's game? #USAvsPortugal #WorldCup2014", "2014-06-23 16:29:51"], ["Moms are 3X more social than the average user and are 8% more influential than the general pop #socialmedia http://t.co/IWSwjKUMDq", "2014-06-23 14:32:44"], ["Same! We can't stop #sendmealife @b1maitlin @rodericm  @UsmeAttari #CandyCrushSaga", "2014-06-20 19:37:54"], ["Soooo, does anyone still play #CandyCrush?  Still crazy about it!", "2014-06-20 19:31:12"], ["Top Shares are up with #FelonCrushFriday #WorldCup2014 #Wimbledon and more! #TGIF http://t.co/jpNBVowJBb", "2014-06-20 18:44:08"], ["ShareThis NYC TGIF jam //  Song premiere: SomeKindaWonderful's 'Shine On Me' http://t.co/VY1c8fPFEd via @usatoday @somekindawonder", "2014-06-20 18:32:53"], ["With #Wimbledon just around the corner, be sure to check out our sharing Wimbledon infographic! http://t.co/OjpnDYFyst", "2014-06-20 16:30:51"], ["What’s Next For Private Exchanges? There's an increasing need for defined protocol and vocabulary #privateexchanges http://t.co/9nq5GnqAlW", "2014-06-19 19:16:24"], ["Check out the latest from the @ShareThis blog! Bloom Filters in the ShareThis Advertising Platform #BloomFilters http://t.co/ESyYSzzA6L", "2014-06-18 14:20:37"], ["Content shared online is more influential on consumer spending that price and brand! Drive your brand's value #RoS http://t.co/iStpDALPwY", "2014-06-18 13:31:20"], ["The Weather Company's @usuallyalex discusses reaching your consumer at the right time on the right screen #mobile http://t.co/5RcERL8oiT", "2014-06-17 17:41:11"], ["The #WorldCup2014 is exciting, but last night's #USAvGHA game made us proud to be American! @ForTheWin #TrendingNow http://t.co/H6QSOsf03W", "2014-06-17 15:32:11"], ["How do you effectively integrate brand advertising into your mobile app? #NativeAdvertising @usuallyalex http://t.co/5RcERL8oiT", "2014-06-17 14:46:10"], ["What’s Next for Private Exchanges? Our VP of Ad Products tells us in this great piece from @adotas http://t.co/0la3mdOEFs", "2014-06-17 13:40:11"], ["Consumers looking to buy a new car are 10X more likely to share auto related content online! #AutoNews http://t.co/8TqH3Xpc8K", "2014-06-17 13:30:47"], ["Although the #StanleyCup is over, online sharing shows that the media lanscape is constantly changing http://t.co/DvyjzQJvYv", "2014-06-16 22:30:25"], ["The #LAKings may have won the #StanleyCup but it looks like #mobile and #social are winning the sports media game! http://t.co/l8mI9xqXWi", "2014-06-16 20:00:09"], ["The #GoTFinale left us all wanting more! #TrendingNow from @mental_floss is 7 historical parallels to #GoT http://t.co/VEf1HTzI04", "2014-06-16 14:57:52"], ["Summer Blockbusters are here so check out the @ShareThis study on social sharing at the #boxoffice http://t.co/bTTJIj4GnW", "2014-06-16 13:25:47"], ["Happy #FathersDay! Need a last minute gift idea? Check out the @forthewin official gift guide, trending now. http://t.co/XTPgGjmEMf", "2014-06-15 16:02:06"], ["While you're enjoying the #WorldCup this weekend, check out the official brews from the 32 countries! #trendingnow http://t.co/SyDL0SYEDk", "2014-06-14 16:30:33"], ["Do you share? We love @srslytheshow and they definitely captured #sharing &amp; food. Back off my fries! #TGIF https://t.co/FJaU38PY1R", "2014-06-13 18:36:09"], ["Ever wonder why #fridaythe13th is so unlucky? @mental_floss trending in our network will fill you in! http://t.co/mXddj93hUz", "2014-06-13 14:47:57"], ["Check out the @sharethis workshop on Data Analysis with Statistical Analysis Language R http://t.co/KkgtUaUZGC", "2014-06-12 18:48:18"], ["The #WorldCup kicks off today, make sure you don't miss a game! @thebiglead has all you need to know #TrendingNow http://t.co/2xVJv3lexz", "2014-06-12 15:47:36"], ["Why do you share? Let us know with #sharethismoment http://t.co/L9hCUDhD4y", "2014-06-11 20:23:47"], ["Don't know what to get for dad on #FathersDay this year? @voguemagazine brings you top 10 gifts! #TrendingNow http://t.co/9hvcNZMOeu", "2014-06-11 19:52:04"], ["Hey New Yorkers, need a place to watch the #WorldCup tournament? @grubstreet is trending right now with some hotspots http://t.co/SbOCGj1Q43", "2014-06-11 15:01:30"], ["Family car shopping? Check out our friends at http://t.co/axn40qwOe9 for all your #FamilyCarAdvice needs! http://t.co/VSA6YZ1yit", "2014-06-11 13:12:15"], ["How can brands reach their hispanic consumers? Don't ignore mobile and understand their social influence! http://t.co/iqa3faEjg7", "2014-06-10 20:35:40"], ["Trending in our network just in time for the #WorldCup @ForTheWin featured this short film from @Nike Check it out! http://t.co/JxpJG7YfwZ", "2014-06-10 18:41:02"], ["At the #AppleWWDC the new #iOS8 was revealed! Check out key new features for developers to make apps more engaging! http://t.co/CAQXyePzpH", "2014-06-10 14:57:10"], ["Family car shopping? Check out our friends at http://t.co/axn40qwOe9 for all your #FamilyCarAdvice needs! http://t.co/Lj6SoQMeQQ", "2014-06-10 13:09:19"], ["What's a share worth? Online sharing can motivate consumers to spend 9.5% more on your product! #RoS http://t.co/P3YDafoS7x", "2014-06-09 21:00:52"], ["Top Shares from @ShareThis with #WorldCup2014 #Parkering #Tonys2014 and Apple's #StockSplit http://t.co/rjj3fu10a0", "2014-06-09 17:50:22"], ["Congrats to @Global_SMG for bringing home an #EffieAward for Most Effective Network in North America! @EffieAwards", "2014-06-06 13:52:06"], ["Top 7 Things to Share this #Summer, #GoT swears winter is coming but we think otherwise. http://t.co/amlDnEAhn6 #concerts #weddingseason", "2014-06-05 20:05:19"], ["Get in and Go H.A.M: Musings from Four Years at a start-up Company @andrewdumas @ShareThis http://t.co/1tGr7C71pH #startup", "2014-06-04 14:26:16"], ["Study from @ShareThis &amp; @Toyota found that auto consumers in market are 10X more likely to share auto related content http://t.co/1ypjyS11Ov", "2014-06-03 15:50:14"], ["We kicked off Summer in CA &amp; NY! Check out our FB for more pics http://t.co/itEc9Cy8Gr http://t.co/fvILNKue67", "2014-05-30 15:12:30"], ["Webinar with @Mashery @USATODAYsports &amp; @ShareThis on how APIs empower cross-platform reach for businesses #API  http://t.co/9OFQtNIcEg", "2014-05-29 19:12:33"], ["Top shares this week are up! Details on #MayaAngelou #FrenchOpen #SerenaWilliams #WorldCup2014 &amp; #SethMacFarlane http://t.co/TqXgX4sSyu", "2014-05-28 18:07:22"], ["Our research found that online sharing can influence consumers to spend 9.5% more! What's a share worth to you? #RoS http://t.co/UrFdTD4wri", "2014-05-27 16:38:15"], ["We have total wanderlust after that long #MemorialDay weekend, @travelchannel knows where to visit this month! http://t.co/04FBD2Bnk1", "2014-05-27 15:24:14"], ["Top shares this week include #NYRPlayoffs #Prust #sriracha #CannesFilmFestival and more! http://t.co/JTIARChLBW", "2014-05-23 17:44:21"], ["Think you know fashion? Trending in our network @voguemagazine tells us 7 designers we need to know! #fashion http://t.co/wYnvaBjbTp", "2014-05-22 17:16:34"], ["Our SVP, Publisher @pclentz spoke @APPNATION on the future of user acquisition and app discovery! #APPNATIONNYC http://t.co/BN7DG7O7vx", "2014-05-22 16:31:26"], ["The @ShareThis Cares initiative was in full swing this weekend with @Beautiful_Day and was a major success!  http://t.co/j2Lpi5ySkc", "2014-05-21 18:36:27"], ["Marketing Daily: When Brand Fans Share, What's the Upside? #AutoNews http://t.co/aktJ9oen6L", "2014-05-21 17:07:41"], ["New research from @sharethis &amp; @Toyota find auto owners are 2.5X more likely to share about brands they own #AutoNews http://t.co/1ypjyS11Ov", "2014-05-21 15:25:32"], ["Spoiler alert! #DWTS finale was awesome and is #trending in our network on @THR Who was your favorite dancer? http://t.co/iNtbJe7fpt", "2014-05-21 15:20:11"], ["Users sharing auto content are 3.6X more likely to respond to ads, new research finds @Toyota &amp; @ShareThis #AutoNews http://t.co/1ypjyS11Ov", "2014-05-20 17:00:53"], ["Why Is Pinterest Suddenly Worth $5 Billion? #Pinterest keeps growing! @sharethis http://t.co/yYEWtmjEvK", "2014-05-20 14:51:42"], ["We're headed over to #APPNATIONNYC, come find us! @pclentz @sshadmand @andrewdumas", "2014-05-20 14:47:04"], ["Study from @ShareThis &amp; @Toyota found that auto consumers in market are 10X more likely to share auto related content http://t.co/1ypjyS11Ov", "2014-05-20 14:17:25"], ["Spring forward to health with our CPG Insights this season #healthyshoppers http://t.co/l5x7eI8QdI", "2014-05-15 16:19:38"], ["Webinar TODAY 10 AM PDT: Sharing the Wealth:APIs Empower Cross-Platform Reach for Businesses and Customers Alike.http://t.co/HPUXUGgECa", "2014-05-13 16:47:43"], ["Weekly top shares are up with #DonaldSterling #CaseyKasem and Chicago Mayor #EmanuelRahm and more! http://t.co/wETeLlpGgD", "2014-05-13 15:11:54"], ["Here's how much your Tweet is worth to advertisers #RoS @ShareThis http://t.co/2MlEMKDjK4", "2014-05-12 13:19:54"], ["The Return on a Share study from @sharethis shows that excellent online shares increase purchase intent by 9.5% #RoS http://t.co/lcOGXMQJKJ", "2014-05-08 20:16:56"], ["Join our webinar May 13 10am: Sharing the Wealth:APIs Empower Cross-Platform Reach for Businesses and Customers Alike.http://t.co/HPUXUGgECa", "2014-05-07 20:08:20"], ["The #RoS report found that recommendations trump price and brand in the consumer decision making process @ShareThis http://t.co/0CIUEBIthO", "2014-05-06 19:22:02"], ["Although popular, #twitter isn't the only second screen for #SocialTV anymore. Check out these cross channel insights http://t.co/La4bx8YPuN", "2014-05-06 14:23:22"], ["The return on an excellent online share is a 9.5% increase in consumer purchase intent, download the study here! #RoS http://t.co/4sgXxsVKlc", "2014-05-06 13:50:08"], ["New Study First to Calculate Dollar Value of Social Sharing #RoS http://t.co/d6qeDWlXeS http://t.co/0UmOM292w9", "2014-05-05 19:32:43"], ["Happy Cinco de Mayo! Check out top shares this week on Nancy Pelosi, #MadMen #CincoDeMayo #target and #Immigration http://t.co/3yYLbQPZ8l", "2014-05-05 17:54:24"], ["We found that recommendations trump price and brand in consumer purchase decisions #RoS Download the RoS report here! http://t.co/bcDWZP98Ff", "2014-05-05 13:22:13"], ["Learn more about the new ShareThis Multi Post widget update coming your way. Learn More. http://t.co/Hp7KqljcwV", "2014-05-02 19:29:53"], ["Download our Return on a Share report, the first of its kind to quantify the monetary value of social sharing! #RoS http://t.co/094mBocPTr", "2014-05-01 16:40:56"], ["Great tip!  RT @JonTromans: TIP: Use ShareThis http://t.co/rznnCvzBly to place share buttons on all pages of your website or blog.", "2014-05-01 15:55:43"], ["RT @MrBauWow: @ShareThis CEO Kurt Abrahamson spreading the sharing gospel on @CNBC #FastMoney #sharethismoment http://t.co/ZCcqCol7hZ", "2014-05-01 15:54:31"], ["What’s a Share Worth to You? Online Sharing Proves to Be Important in Purchase Intent #RoS http://t.co/2AbOFk6pS7", "2014-04-30 21:31:26"], ["Study: Shared content can increase spending by 10% - Social Marketing - BizReport #RoS http://t.co/c6Qs2pWyqv", "2014-04-30 19:21:45"], ["The Return on a Share report is now available for download! #RoS http://t.co/iAECLfoWCY", "2014-04-30 16:20:35"], ["ShareThis Calculates Cash Value of a Share #RoS http://t.co/caNhROTrmz @ClickZ", "2014-04-30 16:18:54"], ["That ends our Return on Sharing Summit! Thanks everyone for a great discussion! http://t.co/32aPRKCpAp", "2014-04-30 16:01:13"], ["Brands showing up as creators, bringing content not ads to users, are the ones that are doing well, says @claude_brown of @tumblr #RoS", "2014-04-30 15:54:41"], ["\"Timing is critical and we are all on the heels of mobile--the foremost content consumption device\" says @jpmarcum #RoS", "2014-04-30 15:50:53"], ["\"Great content + engaged scale= effective audiences\" says an audience member. Does this still ring true? #RoS", "2014-04-30 15:48:26"], ["\"Great content and stories find massive audiences\" says @claude_brown of @tumblr #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:44:46"], ["\"Applying technology to create the consumption of content that is great for the audience is critical\" @Bankoff #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:43:01"], ["\"Difference between good and bad with native is difficult to quantify, so difficult to measure\" @arctictony #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:38:01"], ["\"Profound but subtle messaging will lead to engagement\" says @Bankoff #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:36:22"], ["Native advertising is one solution for publishers says @emilysteel of @FT How well does it work? #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:34:01"], ["\"Understanding how to make content most accessible and relevant to its intended audience\" says @jpmarcum #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:27:35"], ["\"Facebook and Google are trying to reduce noise and create signal\" says @Bankoff #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:25:27"], ["Our innovations in media panelists at the Return on Sharing Summit #RoS http://t.co/pp2aX0Xtie", "2014-04-30 15:23:11"], ["\"We don't think that social is just a fad, but a way for individuals to interact in different ways\" @claude_brown RoS http://t.co/qbzVL4gihi", "2014-04-30 15:21:15"], ["\"We are Interested in working with brands to help them tell their authentic story\" @claude_brown #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:20:04"], ["\"The human element of sharing is a differentiator\" @jpmarcum #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:16:44"], ["\"If we have the content that drives brand loyalty, then that content will resonate best\" @Bankoff #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:15:55"], ["Innovations in media panel! #RoS understanding the monetary value of social sharing http://t.co/ZL56O9kTDy", "2014-04-30 15:13:48"], ["\"Getting consumers to your content is an important part of the process to drive engagement\" @jpmarcum #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:11:38"], ["\"Clearly a correlation between sharing content and increased viewability for that conten\" @arctictony #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:10:19"], ["Tumblr is a place for people to create and engage with content that resonates at great scale @claude_brown #RoS http://t.co/qbzVL4gihi", "2014-04-30 15:08:43"], ["Huge opportunity and potential for sharing, still so much to learn and understand! #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:54:15"], ["Connecting shareability and paid advertising is key strategy for brands and marketers #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:52:41"], ["\"You have to know who your key influencers are, keep engagement with them and provide them with something that interests them\" #RoS", "2014-04-30 14:48:33"], ["\"Social acts as a funnel for individuals and a way to filter out the noise-- reason why The Return on a Share report is so critical\" #RoS", "2014-04-30 14:45:05"], ["\"Real time marketing needs to be substantive to users for more than just for a moment\" #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:43:17"], ["\"Experimenting with RTM to understand what is working an what's not to allocate the right resources\" #RoS @beardrs http://t.co/qbzVL4gihi", "2014-04-30 14:42:15"], ["Use timeliness and RTM when it is appropriate, when a consumer is influenced about the next thing that they are going to buy @babashetty", "2014-04-30 14:41:17"], ["\"How do you use RTM to create currency with people that matter?\" @AndyMarkowitz #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:39:59"], ["\"Using social as a means to get to real time insights and opportunities using data are part of what we do\" @AndyMarkowitz #RoS", "2014-04-30 14:38:57"], ["Our SME's are brands as publishers, creating content to drive consumer engagement @AndyMarkowitz #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:36:44"], ["\"Understanding the charateristics of content that drives sharing is extremely startegic for your brand\" @beardrs #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:34:34"], ["\"Systematic approach that sees pockets of interest around our brand to drive engagement\" @babashetty #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:32:58"], ["\"We are entering a tremendous age of accountability for brands\" @AndyMarkowitz #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:31:02"], ["\"Sharing should drive outcome, and that's what happens after the click because that is where the true value is\" @AndyMarkowitz #RoS", "2014-04-30 14:28:49"], ["Good content finds it's audience. It should have currency, it should have an outcome. #RoS", "2014-04-30 14:28:42"], ["Sharing is anexcellent complement to brand's paid owned and earned media #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:25:45"], ["How do you drive sharing of content with predictability and how do you measure it? @beardrs #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:23:13"], ["Looking at 2 paths in which you can find a brands content, when they arrive thru a personal endorsement it's worth much more @babashetty", "2014-04-30 14:22:33"], ["\"50% increase in high value tasks completed when someone arrives at this task through sharing\" #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:21:22"], ["Sharing says something about a consumer when they decide to share something, part of their identity! #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:20:34"], ["Sharing is a basic human behavior and natural to us @babashetty #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:20:08"], ["Sharing is a signal with enormous potential value #RoS @babashetty http://t.co/qbzVL4gihi", "2014-04-30 14:19:22"], ["Social helps us reach our consumers #RoS @AndyMarkowitz http://t.co/qbzVL4gihi", "2014-04-30 14:18:52"], ["Layers of sharing search adds relevance and credibility that search doesn't have #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:18:00"], ["Online sharing around content and people can we an extremely powerful action @AndyMarkowitz #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:17:13"], ["Quantification is really important in the digital market that we are living in, we all way analytics to determine our impact! @tkawaja #RoS", "2014-04-30 14:15:09"], ["Sharing is a critial way for marketers and brands to get their message out to consumers #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:14:22"], ["What's the economic impact of sharing? @tkawaja tells us! #RoS http://t.co/Ok2c8FB0HO", "2014-04-30 14:13:44"], ["Marketing in a digital age-How do you get your point across in this crowded marketplace? Sharing content! #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:12:34"], ["@tkawaja says 4 seconds of fame might be just as good as 15 minutes! #MadMen He's now moderating our Economic Impact of Sharing panel #RoS", "2014-04-30 14:10:55"], ["Sharing has been part of human nature for thousands of years @tkawaja #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:10:55"], ["Taking this math and these concpets and bring them to action for marketers and brands #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:08:58"], ["Our panel moderator @tkawaja on AMC's Mad Men! Check him out! http://t.co/qbzVL4gihi #RoS", "2014-04-30 14:08:24"], ["Value of the Sharing Economy, interesting content and trends for consumers, brands and publishers #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:07:01"], ["From our data we create interesting opportunities and insights for publishers and brands #RoS @kurtabra http://t.co/qbzVL4gihi", "2014-04-30 14:04:06"], ["\"Analytics that we give publishers shows data cross all services\" #RoS @kurtabra @ShareThis http://t.co/qbzVL4gihi", "2014-04-30 14:03:31"], ["Pinterest emerged as the 3rd largest social sharing platform &amp; Twitter the main platform for financial world #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:02:31"], ["The Sharing Economy is always changing, interacting with each other in new and different ways #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:01:41"], ["Publishers are creating the strong and shareable content #RoS http://t.co/s2GhcbB4Ao", "2014-04-30 14:00:52"], ["Sharing in our network of large and small publishers across multiple verticals, entertainment, tech, CPG #RoS http://t.co/qbzVL4gihi", "2014-04-30 14:00:21"], ["Why do people share? People share content that matters to them and those around them #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:57:01"], ["Email continues to decline as a sharing tool, while Facebook and Pinterest keep soaring #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:55:31"], ["Sharing matters! Consumers turn to online sharing for purchase decisions, over online ratings and reviews #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:54:13"], ["We looked at 5 recommendation aspects - consumer reviews, consumer ratings, online sharing, recs from friends &amp; #1 was professional #RoS", "2014-04-30 13:50:50"], ["Online sharing second to only in person recommendations! Social sharing carries significant impact @kurtabra #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:50:30"], ["Excellent online shares have a 9.5% increase in consumer purchase intent #RoS http://t.co/s2GhcbB4Ao", "2014-04-30 13:48:33"], ["Negative recommendations around sharing have a greater impact than on the positive side -@kurtabra #RoS http://t.co/iyHt9A5SWz", "2014-04-30 13:48:12"], ["Negative sharing has a negative 11% impact on consumer purchase decisions #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:47:47"], ["Social media needs to be a part of market strategies for brands in order to reach their consumers @kurtabra #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:45:50"], ["Scale of online social networks is so much greater than word of mouth @kurtabra @kurnit #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:44:35"], ["Consumers turn to online sharing when making purchase decisions, over price and brand! @kurtabra @kurnit #RoS http://t.co/qbzVL4gihi", "2014-04-30 13:43:06"], ["Tune into the live stream of the Return on Sharing Summit presented by @ShareThis &amp; @Media_Council at 9:15! #RoS http://t.co/0GoWT1obZQ", "2014-04-30 12:50:49"], ["What’s the Monetary Value of Social Shares? | Mediashift | PBS #RoS http://t.co/hLaxubxpnq", "2014-04-30 12:39:46"], ["Study show Positive Online Sharing Increases Purchase Intent By 9.5% @ShareThis #RoS http://t.co/BJc0nXczDK", "2014-04-30 12:23:10"], ["The sharing effect, @kurtabra on CNBC's Fast Money! Determining the monetary value of a social share #RoS http://t.co/gPGjW0slKr", "2014-04-30 01:10:02"], ["Researchers Have Actually Figured Out Dollar Values Of Social Media Recommendations  #RoS @businessinsider http://t.co/ddAJHNL681", "2014-04-30 00:59:26"], ["The Things You Say on Facebook Affect How Much Your Friends Will Pay for Products http://t.co/DIVmFbI0iF via @TheAtlantic", "2014-04-29 22:26:29"], ["New research from @ShareThis &amp; @Media_Council quantifies the monetary value of an online share for the 1st time! #RoS http://t.co/DqLAfu5kAd", "2014-04-29 22:16:01"], ["Tune into CNBC's Fast Money tonight to see our CEO @kurtabra live at 5:30PM! #RoS", "2014-04-29 21:15:32"], ["The Return on Share Study Quantifies Monetary Value of Social Sharing #RoS http://t.co/5yPKukvmYm", "2014-04-28 18:33:40"], ["On 4/30 @ShareThis &amp; @Media_Council present the Return on Sharing Summit. Tune in for a live stream of the event #RoS http://t.co/GV2zKtrTFj", "2014-04-28 16:13:21"], ["Tune in for live stream of the #RoS event presented by @ShareThis &amp; @Media_Council putting a $ value on social shares http://t.co/hkx1xfbtXO", "2014-04-26 13:20:28"], ["Return on Sharing Summit on 4/30 presented by @ShareThis &amp; @Media_Council puts a $ value on social sharing! #RoS http://t.co/IpAQeQ7v5c", "2014-04-25 17:29:47"], ["In 5 days @sharethis &amp; @Media_Council present #RoS quantifying the monetary value of a share for the first time http://t.co/6XNJLZ2dyX", "2014-04-25 15:14:23"], ["Tune in for the live stream of the Return on Sharing Summit presented by @ShareThis &amp; @Media_Council on 4/30 #RoS http://t.co/LJJPwDADTQ", "2014-04-24 20:42:22"], ["We'll listen to #LetItGo till summer melts away our #Frozen hearts - we compiled the best frozen parodies! http://t.co/PaXL37Pmo0", "2014-04-24 18:59:10"], ["Moms are 3X more social than the average user but what are the implications? At #RoS we put a $ value on sharing http://t.co/YPWLPEJudj", "2014-04-24 18:28:52"], ["Only 6 days until @ShareThis and @Media_Council quantify the monetary value of a share for the first time! #RoS http://t.co/rnD4O0dr13", "2014-04-24 16:21:49"], ["Latest from the @sharethis blog! 5 Ideas That DevOps Engineers can Borrow from Biology #biology #DevOps http://t.co/gHgB0xlqIK", "2014-04-24 14:34:14"], ["Discussing the economic impact of sharing @babashetty @AndyMarkowitz @tkawaja @beardrs &amp; sharing as an exchange #RoS http://t.co/Bd742byDWk", "2014-04-23 20:46:45"], ["April 30th @ShareThis &amp; @Media_Council present Return on Sharing Summit, changing the game for brand marketers #RoS http://t.co/oIRkGirls8", "2014-04-23 16:59:46"], ["Top Shares this week with #WrigleyField100, #Letterman #StephenColbert  #HillaryClinton and #Pujols500 http://t.co/u8oSgBAEiY", "2014-04-23 15:55:05"], ["Innovations in Media &amp; Consumer Engagement panelists #RoS @emilysteel @Jpmarcum @arctictony @bankoff @claude_brown http://t.co/c1OhLI0vrD", "2014-04-23 14:19:59"], ["Hispanic consumers are 2X as social, what does that mean for brands? We put a $ value on social sharing #RoS on 4/30 http://t.co/XhymIFGCsC", "2014-04-22 20:38:06"], ["In 8 days @ShareThis &amp; @Media_Council present Return on Sharing Summit, quanitifying economic value of sharing #RoS http://t.co/dA8A7AgVG1", "2014-04-22 17:30:43"], ["It’s Earth Day, y’all! So start saving energy and the environment by giving mother earth a big hug today! #EarthDay http://t.co/XstQc1WWuP", "2014-04-22 17:15:43"], ["Join @ShareThis &amp; @paleycenter for a live stream of Return on Sharing Summit with Sr. Media and Marketing execs #RoS http://t.co/HMENRgx5t0", "2014-04-21 20:19:18"], ["On April 30th @ShareThis &amp; @paleycenter present The Return on Sharing Summit, changing the game for brand marketers http://t.co/HMENRgx5t0", "2014-04-21 19:12:17"], ["Twitter Strikes Back: Twitter and Reddit Surge, Backed By Younger Mobile Users during Q1, 2014 #socialmedia http://t.co/EB709HzJd6", "2014-04-17 19:52:19"], ["Why Publishers Should Care About Wearables, And How They Can Prepare, excellent piece by @pclentz on #wearables http://t.co/gkdxiGJujh", "2014-04-16 16:54:50"], ["Shared Conversations @michaelkriak on identifying pre-viral content for real time marketing #velocity #innovation http://t.co/DJoKlCwOcF", "2014-04-16 15:42:26"], ["Shared Conversations Series with @michaelkriak on harnessing digital innovation to drive consumer engagement http://t.co/L3uki8DoYq", "2014-04-15 14:45:59"], ["Top Shares with #GameOfThrones #MadMen #MTVMovieAwards the #Masters2014 tournament and #KansasCityshooting http://t.co/7a56mQsnTq", "2014-04-14 18:55:35"], ["Age matters! Sharing on #Reddit skews young, #Facebook &amp; #Twitter skew older with #Twitter &amp; #Pinterest in between! http://t.co/dS0El2HQvv", "2014-04-09 16:07:12"], ["In Q1, sharing on mobile officially surpassed sharing on desktop, growing 2.5X as fast! #mobile #socialmedia http://t.co/dS0El2HQvv", "2014-04-08 16:50:06"], ["Q1 Consumer Sharing Trends Report shows major spike in sharing on #twitter and #reddit driven by growth in mobile http://t.co/htUhyZSF06", "2014-04-08 14:02:48"], ["We are expanding internationally with digital sales leader @AD2ONEUK to bring data-driven insights across the pond! http://t.co/HpTCuaUOGz", "2014-04-02 16:13:20"], ["Today @ShareThis and @AD2ONEUK partner up to bring our insights &amp; social data to international brands and agencies! http://t.co/HpTCuaUOGz", "2014-04-02 14:17:18"], ["Check out how @ShareThis first began! See how Tim Schigel and ShareThis brought Internet users together #connection http://t.co/UZfMixOem2", "2014-04-01 19:49:23"], ["The Return on Sharing Summit with @ShareThis and @paleycenter will take a look at the financial impact of sharing http://t.co/EnXtFjFZmM", "2014-04-01 18:23:47"], ["Top Shares this week about #TheWalkingDead #OpeningDay #MarchMadness #FinalFour and #BustedBracket check them out! http://t.co/dVznni5f0r", "2014-03-31 17:57:59"], ["What's it like to go viral? We asked @jenakingsley about her recent #Starbucks prank, and how she used #socialmedia http://t.co/JYwcbl1smm", "2014-03-27 17:45:13"], ["Perspective from a true entrepreneur! ShareThis board member @HeidiRoizen What I Learned Negotiating With Steve Jobs http://t.co/HWHIE4lpFo", "2014-03-25 19:09:34"], ["@krynsky We're happy to help with customization of our widget!  Try emailing support [at] http://t.co/YV5rhDHNLz :)", "2014-03-25 14:55:41"], ["Check @ShareThis out in @adage and see where your audience is sharing! #socialmedia http://t.co/lLy0AMjfAk", "2014-03-24 19:22:55"], ["Top shares this week! The latest on #MarchMadness and this year's #Sweet16 and Obama's plan inRussia and Crimea http://t.co/bI5VEIVznL", "2014-03-24 15:26:18"], ["It’s been exciting and transformative year for ShareThis as we accelerated our start in #mobile http://t.co/8FjuW2Q4YH", "2014-03-21 14:22:41"], ["@wolfrom says it's all about the caption - we smell a #CaptionThis picture #contest! #ShareThisMoment http://t.co/nSqgcBeHVe", "2014-03-20 20:43:52"], ["Great company meeting today!  #sharethismoment http://t.co/umCQHwNhXN", "2014-03-20 20:15:22"], ["What's trending in the ShareThis network? 16-Year-Old Sneaks to Top of WTC at 4 a.m. and Tweeted About It @NYMag http://t.co/NLxSpnOMbx", "2014-03-20 16:05:31"], ["Moms are a highly social audience, 3X more social than the general population! Check out more insights #tbt #social http://t.co/kET59L6W0O", "2014-03-20 15:46:39"], ["Social Data: Not Just a Short Term Phenomenon, but a Lasting Resource for marketers at any brand #socialmedia #data  http://t.co/7Ca4LJazQN", "2014-03-19 15:25:43"], ["The power of #socialmedia leads to the opportunity to tell a brand's story, an avenue to information and #innovation http://t.co/PPQxf4rmU5", "2014-03-18 18:26:22"], ["Newest Shared Conversations @ShareThis features @generalelectric  director global digital strategy @AndyMarkowitz http://t.co/wKHKlXCjYS", "2014-03-18 15:34:14"], ["What's trending in the @ShareThis network? Lena Dunham is \"nauseated\" by Woody Allen @TheWrap #Girls #trending http://t.co/UI2ai2bh7E", "2014-03-18 14:53:39"], ["Insights on importance of #mobile beyond apps &amp; the impact data will have for marketers @AndyMarkowitz #innovation http://t.co/PPQxf4rmU5", "2014-03-18 14:17:10"], ["Weekly Top Shares! Details on the LA #earthquake &amp; #Ukraine referendum, missing #Flight370 &amp; Happy St. Patrick's Day! http://t.co/DRF87vPhkr", "2014-03-17 17:28:21"], ["Happy Pi Day! #sharethismoment #HappyPiDay http://t.co/VQV0iLkybK", "2014-03-14 19:38:53"], ["Check out the latest from the ShareThis Tech Ops Team! MySQL Backup and Recovery with EBS Volumes II #MySQL http://t.co/mnQFzay5z3", "2014-03-14 16:43:15"], ["Anonymous sharing apps &amp; wearable technology shined at #SXSW as everyone tried to find the next \"it\" company in tech http://t.co/x4MgqJGWi3", "2014-03-13 15:12:13"], ["Looking for an Account Manger position in an awesome work culture? ShareThis is hiring!  http://t.co/Zf6bzPhCAB", "2014-03-12 18:52:31"], ["Top Shares are up! @jimmyfallon &amp; Jon Hamm photobomb, Obama tried to expand overtime &amp; details on #MalaysiaAirlines http://t.co/yEQ7jB57jP", "2014-03-12 15:17:01"], ["Auto brands and marketers need to pay attention to real time weather events like #polarvortex to optimize campaigns http://t.co/xOpQga6ffE", "2014-03-11 18:57:51"], ["Everything is Fit to Share: Exploring the Value of the Sharing Economy panel at #SXSW discovered great insights!  http://t.co/YWDIGn4mF6", "2014-03-11 14:27:05"], ["#SXSW 2014: Monetization Opportunities in a Sharing Economy by @melhwhite http://t.co/NSaLcICCqX  via @clickz #socialmedia #sharingeconomy", "2014-03-10 14:21:51"], ["It's a wrap! #SharingEconomy #SXSW @NASDAQOMX @kurtabra @bill_ingram @nasdaqmccooey @blairgarrou @michaelkriak http://t.co/gbhEECsTRu", "2014-03-08 17:51:32"], ["\"The emergence of user generated content has transformed brand mktg\" @bill_ingram of @Adobe @AdobeSocial #SharingEconomy #SXSW @NASDAQOMX", "2014-03-08 17:05:51"], ["\"We've gone from an economy of consumption to an economy of creation\" @tumblr #SXSW #SharingEconomy @NASDAQOMX", "2014-03-08 17:01:16"], ["\"Half of our web traffic comes from social media\" @michaelkriak of @mashable #sxsw #SharingEconomy @NASDAQOMX", "2014-03-08 16:58:51"], ["Our panelists take the stage! @ShareThis @NASDAQOMX #SharingEconomy #SXSW http://t.co/WgHLfCbphy", "2014-03-08 16:57:35"], ["Discover insights on the #sharingeconomy from industry leaders @kurtabra @nasdaqmccooey @bgarrou @bill_ingram @michaelkriak &amp; @claude_brown", "2014-03-08 15:03:39"], ["In 1 hour @sharethis &amp; @nasdaqOMX co-host the #SXSW leadership panel Everything is Fit to Share: Exploring the Value of the Sharing Economy", "2014-03-08 14:31:01"], ["Join the social conversation today at 10:30AM as industry leaders gather to discuss the #sharingeconomy during #SXSW @ShareThis @NASDAQOMX", "2014-03-08 14:03:09"], ["Trending Right Now: 15 Amazing Hidden Features of Google http://t.co/u9IW3vjwz4 #google #socialmedia", "2014-03-07 16:56:42"], ["For #SXSW @ShareThis &amp; @NASDAQOMX are hosting: Everything is Fit to Share: Exploring the Value of the #SharingEconomy http://t.co/1opSdKW9Rr", "2014-03-07 16:24:14"], ["Join the ShareThis family! View our current exciting career openings on our awesome team! http://t.co/nK0uw4b3Mf", "2014-03-06 19:27:20"], ["Top Shares this week are up! The pizza guy from the #Oscars wasn't an actor &amp; #TrueDetective series finale this week! http://t.co/bJd8qlE9MH", "2014-03-05 18:01:48"], ["It's been 3 years since our VP Ad Products joined @ShareThis ! Check out his hard work building our ad platform! http://t.co/O8QpjgAfda", "2014-03-04 17:49:37"], ["Online sharing behavior from last night's #Oscars has Frozen as the most shared about movie! #socialmedia http://t.co/a6l3QM7AOJ", "2014-03-03 20:50:48"], ["Sharing activity from the #Oscars , the selfie that was heard around the world and trending topics from the show  http://t.co/wqOqnJm6Mw", "2014-03-03 17:55:02"], ["In less than 15 min the epic #Oscars photo w/ @TheEllenShow has more than 325K retweets #socialmedia", "2014-03-03 03:23:33"], ["Are you watching the #Oscars? @TheEllenShow is cracking us up! What movie do you think will win Best Picture?", "2014-03-03 02:03:05"], ["This #Oscars2014 trailer with @theellenshow has us pumped for this weekend! Who do you think will steal the show? http://t.co/AG5wERFRBA", "2014-02-28 19:12:56"], ["We had a great time at the @_AWNY Advertising Working Mothers of the Year Awards! So many inspiring women spoke today #AWMOY #NYC", "2014-02-27 19:47:36"], ["ShareThis is hiring! We are looking for more awesome talent to join our rockstar team...check out our openings! http://t.co/W4ZGONPzvK", "2014-02-26 21:17:26"], ["New research from @ShareThis @Mindshare and @Unilever analyzes the online sharing behavior of Hispanics #socialmedia http://t.co/l6niS6Pc7o", "2014-02-26 19:03:20"], ["You don't want to miss this week's top shares!#PaulRudd #Oscars2014 #TheBachelor #arizonabill #Olympics #socialmedia http://t.co/Rl9xcXm1Nc", "2014-02-26 17:42:24"], ["Member of ShareThis Family First to Obtain Same-Sex Marriage License in Cook County...Congratulations! #Chicago  http://t.co/oOgaU6qqfZ", "2014-02-25 21:27:47"], ["Hispanic Consumers have distinct online social behaviors @kurtabra in @WiredInsights #SocialMedia #HispanicMarketing http://t.co/CieikZAHvw", "2014-02-25 16:25:04"], ["Hispanic Consumers Have Distinct Online Social Behaviors- New research from @ShareThis #socialmedia #mobile http://t.co/7rQIXbXUu2", "2014-02-24 17:39:24"], ["Check out the latest from @sharethis! A Machine Learning Prediction Model Hack-A-Thon with Oxdata (H2O) http://t.co/0YDIiO1HVS", "2014-02-24 16:55:50"], ["ShareThis is hiring! We are looking for more awesome talent to join our rockstar team...check out our openings! http://t.co/BzQNFjXU5Z", "2014-02-21 15:43:47"], ["Great article from @MediaPost Hispanic Consumers are Social Media Catalysts, covering @sharethis' Hispanic study http://t.co/KOSEeVnhDY", "2014-02-21 15:08:10"], ["New research from @sharehis shows Hispanic consumers are more likely to read content than share via #mobile http://t.co/J28HAVY8OR", "2014-02-20 22:32:07"], ["Hispanic millennial behaviors reflect their general age group with more sharing on #mobile #twitter and #pinterest http://t.co/J28HAVY8OR", "2014-02-20 19:33:18"], ["An online share means more from Hispanics than the general population in terms of purchase intent #PowerOfSocial http://t.co/J28HAVY8OR", "2014-02-20 18:11:21"], ["New research from @ShareThis @Mindshare and @Unilever analyzes the online sharing behavior of Hispanics #socialmedia http://t.co/l6niS6Pc7o", "2014-02-20 17:17:54"], ["These top shares are packed with #Olympics2014 hookups, #HouseOfCards, celebrity marriages &amp; #CandyCrush http://t.co/ALffE6hxKc #socialmedia", "2014-02-18 21:55:15"], ["Not into Traditional Valentines? That's OK Neither is the Trending Web http://t.co/rH1IimAxch #ValentinesDay", "2014-02-14 15:18:05"], ["Consumers increasingly prefer visual content online! Great quote @jenhyman on #pinterest growth on the web @contently http://t.co/0POomr4ZdI", "2014-02-13 16:56:50"], ["Derek Jeter announces on Facebook 2014 will be his final season, @forthewin #Jeter #FarewellCaptain #TheCaptain http://t.co/SrNaUt7yP7", "2014-02-12 19:52:14"], ["Shaun White missed his chance to become an Olympic legend...check out the details at @forthewin http://t.co/JgOXsybROQ", "2014-02-12 16:43:52"], ["ShareThis' Predictive Campaign Optimization Platform for the most effective ad campaigns #advertising #RTB http://t.co/NASj3sjHdg", "2014-02-12 15:07:25"], ["#nyfw is in full swing and @PerezHilton has the latest...check out this trending article on @bellathorne http://t.co/yF2SNPtexU", "2014-02-11 22:32:39"], ["This @ScaryMommy article got over ONE MILLION shares! Makes sense since moms are 3X more social! #socialmedia http://t.co/8T4ulNupE9", "2014-02-11 18:57:26"], ["Shared Conversations offers insights into innovative practices for #publishers to connect with audiences @sharethis http://t.co/tyIjCNn4Xy", "2014-02-11 17:32:55"], ["Digital influencer series discovers #publishers strategies for true audience engagement @USATODAYsports #socialmedia http://t.co/tyIjCNn4Xy", "2014-02-11 15:45:11"], ["@Chris_Pirrone talks about the rise of #mobile consumption &amp; the value of #social audiences in today's digital world http://t.co/tyIjCNn4Xy", "2014-02-11 15:32:48"], ["Top shares this week are up! The latest on the #Olympics #thebeatles50 and #MichaelSam from across our network! http://t.co/wgqSXVZDIh", "2014-02-10 18:23:41"], ["Season 4 of #TheWalkingDead started up again last night! Check out this interview from @AMC_TV with @DanaiGuriraTWD http://t.co/HExjCY0gQu", "2014-02-10 15:28:11"], ["RT to enter to win 2 FREE tickets to this years most hilarious comedy @MarryBarryMovie After - the director will be doing a Q&amp;A. NYC only.", "2014-02-10 15:15:09"], ["7 Things You Need To Know About Cross-Device Sharing http://t.co/Nj4ZVqPnRj #socialmedia", "2014-02-07 17:38:31"], ["Before #Olympics2014 begin, check this #SB48 infographic for insights into brands that won the #social conversation http://t.co/FM0ep3zdm6", "2014-02-06 21:05:06"], ["On the field the Seahawks may have won #SB48 but brands driving online social chatter won their own marketing game http://t.co/i3gQJKV7KX", "2014-02-06 20:53:10"], ["Why is #socialmedia important for ad inventory in #programmatic? New metrics emerge as #content becomes currency http://t.co/1OgSFHK1RV", "2014-02-06 15:44:10"], ["How the #IoT and #Fitbit are changing our behaviors in a positive way...The latest from @sharethis @andrewdumas http://t.co/Vmvv2hWCwR", "2014-02-05 15:56:38"], ["ShareThis presented at Big Data Innovation Summit on #socialmedia and #mobile and what they mean for data &amp; marketers http://t.co/TPCJgm7mwY", "2014-02-04 19:48:35"], ["Happy 10th Anniversary #Facebook ! Gone from college startup to social giant and still growing! @USATODAY http://t.co/lXesMXk4j0", "2014-02-04 18:01:24"], ["Top Shares for this week are up! Updates on #Microsoft and Staya Nadella, #SB48 and the upcoming Sochi Olympics http://t.co/5L2gMHggV8", "2014-02-04 16:30:14"], ["Old School #SuperBowl Ads May Be Losing Their Touch #SB48 http://t.co/95v26CSpUc", "2014-02-03 21:01:33"], ["Great article by @prasanta_behera why #social matters in a programatic &amp; new metrics in ad inventory @adexchanger http://t.co/0V7nR3Kjhs", "2014-01-30 15:52:13"], ["ShareThis gives back to the #AmericanRedCross with a company wide blood drive! http://t.co/ApIizHQUob #giveback #ShareThisMoment", "2014-01-30 15:39:38"], ["Automatic &amp; Free Start off the Year with a ShareThis Widget Update http://t.co/qu1aFKNl2p #socialmedia", "2014-01-29 20:31:54"], ["Top Shares from the @sharethis network this week are up! President Obama's #SOTU address and #GRAMMYs news http://t.co/wTPb0W5kQz", "2014-01-29 19:50:11"]]